{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "10.1038/s41596-019-0213-z",
    "title": "Generation of blood vessel organoids from human pluripotent stem cells",
    "source": "s41596-019-0213-z.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "BSL-2",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": true,
    "contamination_control": []
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "hiPSC line NC8",
      "properties": {
        "cell_type": "induced pluripotent stem cell",
        "source": "M. Boehm, Center for Molecular Medicine, NHLBI"
      }
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "Y-27632",
      "properties": {
        "catalog_number": "688000",
        "vendor": "Calbiochem",
        "concentration": "50 µM"
      }
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "CHIR99021",
      "properties": {
        "catalog_number": "4423",
        "vendor": "Tocris Bioscience",
        "concentration": "12 µM"
      }
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "BMP-4",
      "properties": {
        "catalog_number": "130-111-165",
        "vendor": "Miltenyi Biotec",
        "concentration": "30 ng/mL"
      }
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "VEGF-A",
      "properties": {
        "catalog_number": "100-20",
        "vendor": "Peprotech",
        "concentration": "100 ng/mL"
      }
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "FGF-2",
      "properties": {
        "catalog_number": "130-093-841",
        "vendor": "Miltenyi Biotec",
        "concentration": "100 ng/mL"
      }
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "Forskolin",
      "properties": {
        "catalog_number": "F3917",
        "vendor": "Sigma",
        "concentration": "2 µM"
      }
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "Fetal Bovine Serum (FBS)",
      "properties": {
        "catalog_number": "10270-106",
        "vendor": "Gibco",
        "percentage": "15 %"
      }
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "Matrigel (growth factor reduced)",
      "properties": {
        "catalog_number": "356231",
        "vendor": "Corning"
      }
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "PureCol (Collagen I)",
      "properties": {
        "catalog_number": "5005",
        "vendor": "Advanced BioMatrix"
      }
    },
    {
      "id": "e11",
      "type": "container",
      "name": "6-well low‑attachment plate",
      "properties": {
        "catalog_number": "0030720113",
        "vendor": "Eppendorf"
      }
    },
    {
      "id": "e12",
      "type": "container",
      "name": "12-well tissue‑culture plate",
      "properties": {
        "catalog_number": "353043",
        "vendor": "BD Falcon"
      }
    },
    {
      "id": "e13",
      "type": "container",
      "name": "96-well ultra‑low‑attachment U‑bottom plate",
      "properties": {
        "catalog_number": "MS9096-U",
        "vendor": "Sumilon"
      }
    },
    {
      "id": "e14",
      "type": "instrument",
      "name": "CO₂ incubator",
      "properties": {
        "model": "Galaxy 170S",
        "vendor": "New Brunswick"
      }
    },
    {
      "id": "e15",
      "type": "instrument",
      "name": "Biological safety cabinet",
      "properties": {
        "model": "SafeFAST Premium 212",
        "vendor": "Faster"
      }
    },
    {
      "id": "e16",
      "type": "instrument",
      "name": "Stereomicroscope",
      "properties": {
        "model": "Stemi 2000",
        "vendor": "Zeiss"
      }
    },
    {
      "id": "e17",
      "type": "instrument",
      "name": "Inverted microscope",
      "properties": {
        "model": "Vert.A1",
        "vendor": "Zeiss"
      }
    },
    {
      "id": "e18",
      "type": "sample",
      "name": "hPSC aggregates (day –1)",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "sample",
      "name": "Mesoderm‑induced aggregates (day 3)",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "sample",
      "name": "Vascular‑induced aggregates (day 5)",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "sample",
      "name": "Vascular networks in collagen‑Matrigel (day 10)",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "sample",
      "name": "Blood vessel organoids (day 15)",
      "properties": {}
    },
    {
      "id": "e23",
      "type": "sample",
      "name": "NSG mouse (immunocompromised)",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e18"
      ],
      "params": {
        "cell_line": "e1",
        "cell_number_per_well": "2×10^5 cells",
        "plate": "e11",
        "medium_additive": "e2",
        "additive_concentration": "50 µM",
        "incubation_time": "1 d",
        "incubation_temperature": "37 °C",
        "incubation_CO2": "5 %"
      },
      "notes": "Aggregate formation on day –1 in low‑attachment 6‑well plate."
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e18"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "day": "0",
        "medium_change": true,
        "additives": [
          {
            "reagent": "e3",
            "concentration": "12 µM"
          },
          {
            "reagent": "e4",
            "concentration": "30 ng/mL"
          }
        ],
        "incubation_time": "3 d",
        "incubation_temperature": "37 °C",
        "incubation_CO2": "5 %"
      },
      "notes": "Mesoderm induction (days 0–3)."
    },
    {
      "id": "s3",
      "op": "transfer",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e20"
      ],
      "params": {
        "day": "3",
        "medium_change": true,
        "additives": [
          {
            "reagent": "e5",
            "concentration": "100 ng/mL"
          },
          {
            "reagent": "e7",
            "concentration": "2 µM"
          }
        ],
        "incubation_time": "2 d",
        "incubation_temperature": "37 °C",
        "incubation_CO2": "5 %"
      },
      "notes": "Vascular lineage induction (days 3–5)."
    },
    {
      "id": "s4",
      "op": "manipulate",
      "inputs": [
        "e20"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "day": "5",
        "action": "embed_in_matrix",
        "matrix_components": [
          {
            "reagent": "e9"
          },
          {
            "reagent": "e10"
          }
        ],
        "plate": "e12",
        "additives": [
          {
            "reagent": "e5",
            "concentration": "100 ng/mL"
          },
          {
            "reagent": "e6",
            "concentration": "100 ng/mL"
          },
          {
            "reagent": "e8",
            "percentage": "15 %"
          }
        ],
        "incubation_time": "5 d",
        "incubation_temperature": "37 °C",
        "incubation_CO2": "5 %"
      },
      "notes": "Embedding of aggregates in collagen I–Matrigel matrix; vessel sprouting (days 5–10)."
    },
    {
      "id": "s5",
      "op": "manipulate",
      "inputs": [
        "e21"
      ],
      "outputs": [
        "e22"
      ],
      "params": {
        "day": "10",
        "action": "extract_networks",
        "tool": "e16",
        "duration": "~20 min per well",
        "estimated_networks_per_well": "50–60",
        "transfer_to": "e13",
        "culture_conditions": {
          "plate_type": "ultra‑low‑attachment U‑bottom",
          "medium": "suspension culture medium (StemPro‑34 SFM with supplements)",
          "incubation_temperature": "37 °C",
          "incubation_CO2": "5 %"
        }
      },
      "notes": "Extraction of vascular networks and self‑assembly into round organoids."
    },
    {
      "id": "s6",
      "op": "manipulate",
      "inputs": [
        "e22"
      ],
      "outputs": [],
      "params": {
        "day": "15",
        "action": "transplant",
        "recipient": "e23",
        "site": "kidney capsule",
        "method_reference": "as described for liver organoids (ref. 37)"
      },
      "notes": "Transplantation of blood vessel organoids into immunocompromised NSG mice."
    },
    {
      "id": "s7",
      "op": "observe",
      "inputs": [
        "e21",
        "e22"
      ],
      "outputs": [],
      "params": {
        "instrument": "e17",
        "mode": "bright‑field microscopy",
        "timepoints": [
          "day 8",
          "day 10",
          "day 15"
        ]
      },
      "notes": "Monitor sprouting, network formation, and organoid maturation."
    },
    {
      "id": "s8",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {
        "text": "All media changes on days 0, 3, and 5 are performed by gentle gravitation; no centrifugation is applied."
      },
      "notes": ""
    }
  ]
}