{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "",
    "title": "Protocol",
    "source": "s41596-019-0213-z.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": false,
    "sterility_required": true,
    "contamination_control": []
  },
  "entities": [
    {
      "id": "e1",
      "type": "instrument",
      "name": "Confocal microscope (Zeiss, LSM 780)",
      "properties": {
        "objectives": [
          "10×",
          "20×",
          "63×"
        ],
        "software": "ZEN"
      }
    },
    {
      "id": "e2",
      "type": "consumable",
      "name": "Ultra Plus slides",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "Growth factor‑reduced Matrigel",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "DMEM/F12",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "KnockOut DMEM/F12",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "KnockOut Serum Replacement",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "Glutamax",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "NEAAs",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "β‑mercaptoethanol (stock)",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "Penicillin–streptomycin",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "reagent",
      "name": "0.5 mM EDTA in sterile PBS",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "reagent",
      "name": "Sterile PBS",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "reagent",
      "name": "2‑Mercaptoethanol dilution (1:100, 10 mL)",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "reagent",
      "name": "DMEM powder (for 10× DMEM)",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "reagent",
      "name": "Deionized water",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "consumable",
      "name": "0.2‑µm bottle‑top filter",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "reagent",
      "name": "Neurobasal medium",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "reagent",
      "name": "B27 supplement",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "reagent",
      "name": "N2 supplement",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "reagent",
      "name": "StemPro‑34 SFM medium",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "reagent",
      "name": "StemPro‑34 nutrient supplement",
      "properties": {}
    },
    {
      "id": "e23",
      "type": "reagent",
      "name": "0.1 N NaOH",
      "properties": {}
    },
    {
      "id": "e24",
      "type": "reagent",
      "name": "10× DMEM solution (prepared)",
      "properties": {}
    },
    {
      "id": "e25",
      "type": "reagent",
      "name": "HEPES",
      "properties": {}
    },
    {
      "id": "e26",
      "type": "reagent",
      "name": "7.5 % sodium bicarbonate",
      "properties": {}
    },
    {
      "id": "e27",
      "type": "reagent",
      "name": "Ham’s F‑12",
      "properties": {}
    },
    {
      "id": "e28",
      "type": "reagent",
      "name": "PureCol (collagen I stock)",
      "properties": {}
    },
    {
      "id": "e30",
      "type": "reagent",
      "name": "FBS",
      "properties": {}
    },
    {
      "id": "e31",
      "type": "reagent",
      "name": "BSA",
      "properties": {}
    },
    {
      "id": "e32",
      "type": "reagent",
      "name": "Triton X‑100",
      "properties": {}
    },
    {
      "id": "e33",
      "type": "reagent",
      "name": "Tween 20",
      "properties": {}
    },
    {
      "id": "e34",
      "type": "reagent",
      "name": "Sodium deoxycholate solution (1 % wt/vol)",
      "properties": {}
    },
    {
      "id": "e35",
      "type": "reagent",
      "name": "DAPI (solid)",
      "properties": {}
    },
    {
      "id": "e38",
      "type": "reagent",
      "name": "Sodium deoxycholate (solid)",
      "properties": {}
    },
    {
      "id": "e39",
      "type": "reagent",
      "name": "Formaldehyde solution (10 mL ampule)",
      "properties": {}
    },
    {
      "id": "c1",
      "type": "container",
      "name": "6‑well plate",
      "properties": {}
    },
    {
      "id": "c2",
      "type": "container",
      "name": "1‑mL aliquot tube",
      "properties": {}
    },
    {
      "id": "c3",
      "type": "container",
      "name": "10‑mL vial",
      "properties": {}
    },
    {
      "id": "c4",
      "type": "container",
      "name": "15‑mL Falcon tube",
      "properties": {}
    },
    {
      "id": "c5",
      "type": "container",
      "name": "50‑mL conical tube",
      "properties": {}
    },
    {
      "id": "c6",
      "type": "container",
      "name": "100‑mL beaker",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "manipulate",
      "inputs": [
        "e3",
        "c3"
      ],
      "outputs": [],
      "params": {
        "action": "thaw",
        "temperature": "0 °C (on ice)",
        "duration": "overnight"
      },
      "notes": ""
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e3"
      ],
      "outputs": [
        "e3_aliquot"
      ],
      "params": {
        "volume": "1 mL",
        "container": "c2",
        "temperature": "0 °C (on ice)",
        "sterile": true
      },
      "notes": "Divide Matrigel into 1‑mL aliquots under sterile conditions."
    },
    {
      "id": "s3",
      "op": "annotate",
      "inputs": [
        "e3_aliquot"
      ],
      "outputs": [],
      "params": {},
      "notes": "Store Matrigel aliquots at –20 °C for up to 2 years."
    },
    {
      "id": "s4",
      "op": "transfer",
      "inputs": [
        "e9",
        "e12"
      ],
      "outputs": [
        "e13"
      ],
      "params": {
        "add_volume": "100 µL",
        "to_volume": "10 mL",
        "container": "c5",
        "temperature": "4 °C",
        "light_protection": "dark"
      },
      "notes": "Prepare 2‑mercaptoethanol dilution (1:100)."
    },
    {
      "id": "s5",
      "op": "manipulate",
      "inputs": [
        "e14",
        "e15"
      ],
      "outputs": [
        "e24"
      ],
      "params": {
        "final_volume": "1,000 mL",
        "stirring": true,
        "heating": "120 °C",
        "heating_duration": "10–15 min",
        "filtration": "0.2‑µm bottle‑top filter",
        "storage": "4 °C up to 2 years"
      },
      "notes": "Prepare 10× DMEM solution."
    },
    {
      "id": "s6",
      "op": "transfer",
      "inputs": [
        "e3"
      ],
      "outputs": [],
      "params": {
        "volume_per_well": "1 mL",
        "total_volume": "6 mL",
        "container": "c1",
        "incubation_time": "1 h",
        "incubation_temperature": "37 °C"
      },
      "notes": "Coat entire 6‑well plate with Matrigel; alternatively incubate overnight at 4 °C."
    },
    {
      "id": "s7",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Passage feeder‑free hPSCs using 0.5 mM EDTA in sterile PBS; after thawing, passage at least once before use."
    },
    {
      "id": "s8",
      "op": "transfer",
      "inputs": [
        "e5",
        "e6",
        "e7",
        "e8",
        "e13",
        "e10"
      ],
      "outputs": [
        "aggregation_medium"
      ],
      "params": {
        "volumes": {
          "KnockOut DMEM/F12": "40 mL",
          "KnockOut Serum Replacement": "10 mL",
          "Glutamax": "0.5 mL",
          "NEAAs": "0.5 mL",
          "β‑mercaptoethanol dilution": "35 µL",
          "Penicillin–streptomycin": "0.5 mL"
        },
        "final_volume": "50 mL",
        "storage": "4 °C up to 2 weeks",
        "fresh_preparation": true
      },
      "notes": "Aggregation medium."
    },
    {
      "id": "s9",
      "op": "transfer",
      "inputs": [
        "e4",
        "e18",
        "e19",
        "e20",
        "e7",
        "e13",
        "e10"
      ],
      "outputs": [
        "n2b27_medium"
      ],
      "params": {
        "volumes": {
          "DMEM/F12": "25 mL",
          "Neurobasal medium": "25 mL",
          "B27 supplement": "1 mL",
          "N2 supplement": "0.5 mL",
          "Glutamax": "0.25 mL",
          "β‑mercaptoethanol dilution (1:100)": "35 µL",
          "Penicillin–streptomycin": "0.5 mL"
        },
        "final_volume": "50 mL",
        "storage": "4 °C up to 2 weeks",
        "fresh_preparation": true
      },
      "notes": "N2B27 medium."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "e22"
      ],
      "outputs": [
        "e22_aliquot"
      ],
      "params": {
        "action": "thaw",
        "temperature": "4 °C",
        "duration": "overnight",
        "post_action": "divide into 1.3‑mL aliquots",
        "storage": "–20 °C up to 1 year"
      },
      "notes": "StemPro‑34 nutrient supplement preparation."
    },
    {
      "id": "s11",
      "op": "transfer",
      "inputs": [
        "e21",
        "e22_aliquot",
        "e7",
        "e10"
      ],
      "outputs": [
        "stempro34_complete_medium"
      ],
      "params": {
        "volumes": {
          "StemPro‑34 SFM medium": "50 mL",
          "StemPro‑34 nutrient supplement": "1.3 mL",
          "Glutamax": "0.5 mL",
          "Penicillin–streptomycin": "0.5 mL"
        },
        "final_volume": "50 mL",
        "storage": "4 °C up to 2 weeks",
        "fresh_preparation": true
      },
      "notes": ""
    },
    {
      "id": "s12",
      "op": "transfer",
      "inputs": [
        "e23",
        "e24",
        "e25",
        "e26",
        "e7",
        "e27",
        "e28"
      ],
      "outputs": [
        "collagen_I_solution"
      ],
      "params": {
        "final_volume": "5 mL",
        "final_concentration": "2.0 mg/mL collagen I",
        "pH_target": "~7.4",
        "mix_order": "Add PureCol last; mix gently; avoid vigorous shaking",
        "pH_indicator": "strip"
      },
      "notes": "Prepare 5 mL of 2.0 mg/mL collagen I solution."
    },
    {
      "id": "s13",
      "op": "transfer",
      "inputs": [
        "collagen_I_solution",
        "e3"
      ],
      "outputs": [
        "collagen_I_Matrigel_solution"
      ],
      "params": {
        "volumes": {
          "collagen I solution (2.0 mg/mL)": "4.5 mL",
          "growth factor‑reduced Matrigel": "1.5 mL"
        },
        "container": "c4",
        "temperature": "0 °C (on ice)",
        "mix": "gentle"
      },
      "notes": "Prepare 6 mL of collagen I–Matrigel solution (4:1 dilution)."
    },
    {
      "id": "s14",
      "op": "transfer",
      "inputs": [
        "e30",
        "e31",
        "e32",
        "e33",
        "e34",
        "e12"
      ],
      "outputs": [
        "blocking_buffer"
      ],
      "params": {
        "final_volume": "50 mL",
        "components": {
          "FBS": "1.5 mL",
          "BSA": "0.5 g",
          "Triton X‑100": "250 µL",
          "Tween 20": "250 µL",
          "1 % sodium deoxycholate solution": "500 µL",
          "PBS": "47.5 mL"
        },
        "filtration": "0.2‑µm",
        "storage": "4 °C up to 2 months"
      },
      "notes": ""
    },
    {
      "id": "s15",
      "op": "transfer",
      "inputs": [
        "e38",
        "e15"
      ],
      "outputs": [
        "sodium_deoxycholate_solution"
      ],
      "params": {
        "mass": "1 g",
        "solvent_volume": "100 mL",
        "solvent": "deionized water",
        "temperature": "room temperature (22–23 °C)",
        "storage": "up to 2 years"
      },
      "notes": "Prepare 1 % (wt/vol) sodium deoxycholate solution."
    },
    {
      "id": "s16",
      "op": "transfer",
      "inputs": [
        "e35",
        "e15"
      ],
      "outputs": [
        "DAPI_solution"
      ],
      "params": {
        "mass": "1 mg",
        "solvent_volume": "1 mL",
        "final_concentration": "1 mg/mL",
        "aliquot": true,
        "storage": "–20 °C up to 2 years"
      },
      "notes": ""
    },
    {
      "id": "s17",
      "op": "transfer",
      "inputs": [
        "e33",
        "e12"
      ],
      "outputs": [
        "PBS_T_solution"
      ],
      "params": {
        "final_volume": "1 L",
        "Tween20_volume": "0.5 mL",
        "PBS_volume": "1 L",
        "storage": "room temperature up to 1 month"
      },
      "notes": "Prepare 0.05 % PBS‑T solution."
    },
    {
      "id": "s18",
      "op": "transfer",
      "inputs": [
        "e39",
        "e12"
      ],
      "outputs": [
        "paraformaldehyde_solution"
      ],
      "params": {
        "formaldehyde_volume": "10 mL (one ampule)",
        "PBS_volume": "30 mL",
        "final_volume": "40 mL",
        "storage": "4 °C up to 1 month"
      },
      "notes": "Prepare 4 % paraformaldehyde solution."
    }
  ]
}