{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-019-0213-z",
    "title": "Procedure",
    "source": "https://www.nature.com/articles/s41596-019-0213-z",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "BSL2",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": false,
    "contamination_control": []
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "blood vessel organoid",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "sample",
      "name": "immunocompromised mouse",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "4% PFA solution",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "PBS",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "blocking buffer",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "primary antibody (diluted in blocking buffer)",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "secondary fluorescent antibody (in blocking buffer)",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "DAPI solution (1:1000 in PBS)",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "mounting medium",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "nail polish",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "consumable",
      "name": "cellulose wipe",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "container",
      "name": "Ultra Plus slide",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "instrument",
      "name": "cryostat",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "instrument",
      "name": "orbital shaker",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "instrument",
      "name": "confocal microscope",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "container",
      "name": "2‑mL Eppendorf tube",
      "properties": {}
    },
    {
      "id": "e17",
      "type": "instrument",
      "name": "P1000 pipette (cut tip)",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "instrument",
      "name": "P200 pipette",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "container",
      "name": "22 × 50 mm coverslip",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "consumable",
      "name": "iSpacer",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "sample",
      "name": "gel fragment (vascular network)",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "reagent",
      "name": "PBS‑T solution",
      "properties": {}
    },
    {
      "id": "e23",
      "type": "consumable",
      "name": "parafilm",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e2"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "location": "kidney capsule",
        "note": "one organoid per kidney"
      },
      "notes": "Transplant blood vessel organoid into the kidney capsule of immunocompromised mouse as previously described."
    },
    {
      "id": "s2",
      "op": "manipulate",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "sacrifice and collect transplanted organoid"
      },
      "notes": "If only one kidney was used, keep the opposite kidney as negative control."
    },
    {
      "id": "s3",
      "op": "incubate",
      "inputs": [
        "e1",
        "e3"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "overnight",
        "temperature": "4 °C"
      },
      "notes": "Fix transplants and kidney tissue in 4% PFA solution."
    },
    {
      "id": "s4",
      "op": "annotate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {},
      "notes": "Dehydrate and paraffinize samples according to standard histological procedures (details not provided)."
    },
    {
      "id": "s5",
      "op": "run_device",
      "inputs": [
        "e1",
        "e13"
      ],
      "outputs": [
        "e12"
      ],
      "params": {
        "section_thickness": "2-5 μm",
        "device": "cryostat"
      },
      "notes": "Cut sections with a standard cryostat and collect on Ultra Plus slides."
    },
    {
      "id": "s6",
      "op": "annotate",
      "inputs": [
        "e12"
      ],
      "outputs": [
        "e12"
      ],
      "params": {},
      "notes": "Perform standard de‑paraffinization procedures (details not provided)."
    },
    {
      "id": "s7",
      "op": "annotate",
      "inputs": [
        "e12"
      ],
      "outputs": [
        "e12"
      ],
      "params": {},
      "notes": "Proceed with staining steps 39–45 described below."
    },
    {
      "id": "s8",
      "op": "manipulate",
      "inputs": [
        "e12"
      ],
      "outputs": [
        "e12"
      ],
      "params": {
        "tool": "cellulose wipe",
        "action": "remove PBS"
      },
      "notes": "Carefully remove all PBS from the slides with a cellulose wipe."
    },
    {
      "id": "s9",
      "op": "manipulate",
      "inputs": [
        "e12",
        "e9"
      ],
      "outputs": [
        "e12"
      ],
      "params": {
        "volume": "few drops",
        "action": "add mounting medium and lay coverslip"
      },
      "notes": "Avoid air bubbles."
    },
    {
      "id": "s10",
      "op": "incubate",
      "inputs": [
        "e12"
      ],
      "outputs": [
        "e12"
      ],
      "params": {
        "duration": "overnight",
        "temperature": "room temperature",
        "light": "dark"
      },
      "notes": "Dry overnight in the dark at room temperature."
    },
    {
      "id": "s11",
      "op": "manipulate",
      "inputs": [
        "e12",
        "e10"
      ],
      "outputs": [
        "e12"
      ],
      "params": {
        "action": "seal with nail polish"
      },
      "notes": "Seal the slide with nail polish the next day."
    },
    {
      "id": "s12",
      "op": "run_device",
      "inputs": [
        "e12",
        "e15"
      ],
      "outputs": [
        "e12"
      ],
      "params": {
        "objective": "10×, 20×, or 63×",
        "mode": "confocal imaging",
        "z_stack": "Nyquist sampling"
      },
      "notes": "Generate overview and high‑resolution images of vascular networks and organoids."
    },
    {
      "id": "s13",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e16"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "tool": "P1000 pipette (cut tip)",
        "action": "transfer up to ~60 organoids to 2‑mL Eppendorf tube"
      },
      "notes": "Maximum of ~60 organoids per tube."
    },
    {
      "id": "s14",
      "op": "incubate",
      "inputs": [
        "e1",
        "e3"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "1 h",
        "temperature": "room temperature",
        "action": "add 4% PFA in PBS"
      },
      "notes": "Remove medium carefully before adding PFA."
    },
    {
      "id": "s15",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e4"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "remove PFA solution and add PBS"
      },
      "notes": ""
    },
    {
      "id": "s16",
      "op": "incubate",
      "inputs": [
        "e1",
        "e5"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "2 mL per tube",
        "duration": "2 h",
        "temperature": "room temperature",
        "device": "orbital shaker",
        "action": "rock vertically"
      },
      "notes": "Add blocking buffer to permeabilize/block vascular networks/organoids."
    },
    {
      "id": "s17",
      "op": "incubate",
      "inputs": [
        "e1",
        "e6"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "50–100 μL",
        "duration": "overnight",
        "temperature": "4 °C",
        "device": "orbital shaker",
        "action": "rock upright"
      },
      "notes": "Primary antibody diluted in blocking buffer."
    },
    {
      "id": "s18",
      "op": "wash",
      "inputs": [
        "e1",
        "e22"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "cycles": 3,
        "duration_per_cycle": "10–15 min",
        "solution": "PBS‑T",
        "device": "orbital shaker"
      },
      "notes": "Wash samples the next day."
    },
    {
      "id": "s19",
      "op": "incubate",
      "inputs": [
        "e1",
        "e7"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "50–100 μL",
        "duration": "2 h",
        "temperature": "room temperature",
        "solution": "blocking buffer"
      },
      "notes": "Add secondary fluorescent antibody."
    },
    {
      "id": "s20",
      "op": "wash",
      "inputs": [
        "e1",
        "e22"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "cycles": 2,
        "duration_per_cycle": "10–15 min",
        "solution": "PBS‑T"
      },
      "notes": ""
    },
    {
      "id": "s21",
      "op": "incubate",
      "inputs": [
        "e1",
        "e8"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "10–15 min",
        "temperature": "room temperature"
      },
      "notes": "Add DAPI solution (1:1000 in PBS)."
    },
    {
      "id": "s22",
      "op": "wash",
      "inputs": [
        "e1",
        "e4"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "10–15 min",
        "solution": "PBS"
      },
      "notes": ""
    },
    {
      "id": "s23",
      "op": "manipulate",
      "inputs": [
        "e21",
        "e19"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "action": "glue iSpacers onto one 22 × 50 mm coverslip"
      },
      "notes": "Mounting option B for blood vessel organoids."
    },
    {
      "id": "s24",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e17",
        "e17"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "tool": "P1000 pipette (cut tip)",
        "action": "pipette organoids into molds; remove PBS with P200 pipette"
      },
      "notes": ""
    },
    {
      "id": "s25",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e9"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "add drops of mounting medium and distribute organoids with P200 tip"
      },
      "notes": ""
    },
    {
      "id": "s26",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e19"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "lay second 22 × 50 mm coverslip on top, remove excess mounting medium"
      },
      "notes": ""
    },
    {
      "id": "s27",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "overnight",
        "temperature": "room temperature",
        "light": "dark"
      },
      "notes": "Dry in the dark overnight."
    },
    {
      "id": "s28",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e10"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "seal with nail polish"
      },
      "notes": "Next day seal the coverslip sandwich."
    },
    {
      "id": "s29",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Pause point: Fixed organoids can be kept in PBS in the refrigerator for up to 1 month."
    }
  ]
}