{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-019-0213-z",
    "title": "Procedure",
    "source": "s41596-019-0213-z.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "unknown",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": false,
    "sterility_required": true,
    "contamination_control": [
      "aseptic technique"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "hPSC culture",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "E8 medium",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "0.5 mM EDTA",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "Accutase",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "aggregation medium",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "50 µM Y-27632",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "N2B27 medium",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "12 µM CHIR99021",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "30 ng/mL BMP-4",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "100 ng/mL VEGF-A",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "reagent",
      "name": "2 µM forskolin",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "reagent",
      "name": "collagen I solution",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "reagent",
      "name": "PureCol",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "reagent",
      "name": "Matrigel",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "reagent",
      "name": "StemPro-34 SFM complete medium",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "reagent",
      "name": "15% FBS",
      "properties": {}
    },
    {
      "id": "e17",
      "type": "reagent",
      "name": "4% paraformaldehyde (PFA) in PBS",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "reagent",
      "name": "PBS",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "reagent",
      "name": "0.1% Trypan blue solution",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "container",
      "name": "6-well plate (standard)",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "container",
      "name": "6-well low‑attachment plate",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "container",
      "name": "12-well plate",
      "properties": {}
    },
    {
      "id": "e23",
      "type": "container",
      "name": "15‑mL Falcon tube",
      "properties": {}
    },
    {
      "id": "e24",
      "type": "container",
      "name": "5‑mL serological pipette",
      "properties": {}
    },
    {
      "id": "e25",
      "type": "container",
      "name": "10‑mL serological pipette",
      "properties": {}
    },
    {
      "id": "e26",
      "type": "container",
      "name": "2‑mL Eppendorf tube",
      "properties": {}
    },
    {
      "id": "e27",
      "type": "container",
      "name": "96‑well ultra‑low‑attachment plate",
      "properties": {}
    },
    {
      "id": "e28",
      "type": "container",
      "name": "10‑cm dish",
      "properties": {}
    },
    {
      "id": "e29",
      "type": "instrument",
      "name": "tissue culture microscope",
      "properties": {}
    },
    {
      "id": "e30",
      "type": "instrument",
      "name": "incubator (37 °C)",
      "properties": {}
    },
    {
      "id": "e31",
      "type": "instrument",
      "name": "centrifuge",
      "properties": {}
    },
    {
      "id": "e32",
      "type": "instrument",
      "name": "P1000 pipette",
      "properties": {}
    },
    {
      "id": "e33",
      "type": "instrument",
      "name": "P200 pipette",
      "properties": {}
    },
    {
      "id": "e35",
      "type": "instrument",
      "name": "stereomicroscope",
      "properties": {}
    },
    {
      "id": "e36",
      "type": "instrument",
      "name": "laminar flow station",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e2"
      ],
      "outputs": [],
      "params": {
        "action": "remove E8 medium",
        "container": "e20"
      },
      "notes": "Wash hPSCs with 0.5 mM EDTA by removing E8 medium."
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e3"
      ],
      "outputs": [],
      "params": {
        "volume": "0.6 mL per well",
        "container": "e20"
      },
      "notes": "Add 0.6 mL of 0.5 mM EDTA per well of a 6‑well plate."
    },
    {
      "id": "s3",
      "op": "manipulate",
      "inputs": [
        "e3"
      ],
      "outputs": [],
      "params": {
        "action": "aspirate EDTA solution",
        "container": "e20"
      },
      "notes": ""
    },
    {
      "id": "s4",
      "op": "transfer",
      "inputs": [
        "e4"
      ],
      "outputs": [],
      "params": {
        "volume": "0.6 mL per well",
        "container": "e20"
      },
      "notes": "Add Accutase."
    },
    {
      "id": "s5",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "3–5 min",
        "temperature": "37 °C"
      },
      "notes": "Incubate Accutase for 3–5 min at 37 °C. Monitor cells under microscope until they round up."
    },
    {
      "id": "s6",
      "op": "observe",
      "inputs": [
        "e1"
      ],
      "outputs": [],
      "params": {
        "instrument": "e29"
      },
      "notes": "Closely monitor cells under the tissue culture microscope until the cells start to round up."
    },
    {
      "id": "s7",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [],
      "params": {
        "instrument": "e32",
        "action": "dissociate cells",
        "repetitions": "2–3×"
      },
      "notes": "Dissociate the cells with a P1000 pipette and pipette gently up and down (2–3×)."
    },
    {
      "id": "s8",
      "op": "transfer",
      "inputs": [
        "e5"
      ],
      "outputs": [
        "e23"
      ],
      "params": {
        "volume": "5 mL",
        "instrument": "e24",
        "destination": "e23"
      },
      "notes": "Resuspend cells in 5 mL aggregation medium using a 5‑mL serological pipette and collect in a 15‑mL Falcon tube."
    },
    {
      "id": "s9",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e19"
      ],
      "outputs": [],
      "params": {
        "volume1": "10 μL cell suspension",
        "volume2": "10 μL 0.1% Trypan blue",
        "instrument": "e32"
      },
      "notes": "Mix 10 μL of cell suspension and 10 μL of 0.1% Trypan blue."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "volume": "10 μL",
        "instrument": "e32",
        "destination": "counting chamber slide"
      },
      "notes": "Pipette 10 μL of the mixture onto a counting chamber slide."
    },
    {
      "id": "s11",
      "op": "observe",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e29"
      },
      "notes": "Count viable cells using an automated cell counter or under a microscope."
    },
    {
      "id": "s12",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Calculate the cell suspension volume needed for the experiment (2 × 10⁵ cells per well). Adjust for lines that form poor aggregates (5 × 10⁵–1 × 10⁶ cells per well)."
    },
    {
      "id": "s13",
      "op": "centrifuge",
      "inputs": [
        "e23"
      ],
      "outputs": [],
      "params": {
        "speed": "300 g",
        "duration": "5 min",
        "temperature": "22–23 °C"
      },
      "notes": "Centrifuge the cells at 300 g for 5 min (22–23 °C) and aspirate the medium."
    },
    {
      "id": "s14",
      "op": "manipulate",
      "inputs": [
        "e5",
        "e6"
      ],
      "outputs": [],
      "params": {
        "volume_per_well": "3 mL",
        "container": "e21"
      },
      "notes": "Resuspend the cells in fresh aggregation medium (3 mL per well) containing 50 µM Y‑27632."
    },
    {
      "id": "s15",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "volume_per_well": "3 mL",
        "destination": "e21"
      },
      "notes": "Place 3 mL of cell suspension per well into a 6‑well low‑attachment plate."
    },
    {
      "id": "s16",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "1 d",
        "temperature": "37 °C"
      },
      "notes": "Incubate for 1 day until cell aggregates with smooth borders (>50–100 µm) have formed."
    },
    {
      "id": "s17",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e25",
        "destination": "e23"
      },
      "notes": "One day after aggregates have formed (d0), transfer the aggregates to a 15‑mL Falcon tube with a 10‑mL serological pipette and let settle by gravitation."
    },
    {
      "id": "s18",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Do not discard the 6‑well plate; save it for later aggregate replating."
    },
    {
      "id": "s19",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "15–20 min",
        "action": "allow aggregates to settle"
      },
      "notes": "After aggregates have collected at the bottom of the 15‑mL Falcon tube (15–20 min), carefully aspirate the medium."
    },
    {
      "id": "s20",
      "op": "manipulate",
      "inputs": [
        "e7",
        "e8",
        "e9"
      ],
      "outputs": [],
      "params": {
        "volume_per_well": "3 mL",
        "destination": "e21"
      },
      "notes": "Resuspend aggregates (3 mL per well) in N2B27 medium + 12 µM CHIR99021 + 30 ng/mL BMP‑4 and transfer back to the low‑attachment plate."
    },
    {
      "id": "s21",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e32",
        "frequency": "once per day"
      },
      "notes": "Use a P1000 pipette to quickly resuspend the aggregates once per day to avoid excessive fusion."
    },
    {
      "id": "s22",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "3 d",
        "temperature": "37 °C"
      },
      "notes": "Incubate for 3 days to induce mesodermal differentiation."
    },
    {
      "id": "s23",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e25",
        "destination": "e23"
      },
      "notes": "On day 3, transfer the aggregates to a 15‑mL tube and let settle by gravitation."
    },
    {
      "id": "s24",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate medium"
      },
      "notes": "After aggregates have collected at the bottom, carefully aspirate the medium."
    },
    {
      "id": "s25",
      "op": "manipulate",
      "inputs": [
        "e7",
        "e10",
        "e11"
      ],
      "outputs": [],
      "params": {
        "volume_per_well": "3 mL",
        "destination": "e21"
      },
      "notes": "Resuspend aggregates (3 mL per well) in N2B27 medium + 100 ng/mL VEGF‑A + 2 µM forskolin and transfer back to low‑attachment plates."
    },
    {
      "id": "s26",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "2 d",
        "temperature": "37 °C"
      },
      "notes": "Incubate for 2 more days."
    },
    {
      "id": "s27",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Calculate the number of wells of a 12‑well plate needed for aggregate embedding (≈40–60 aggregates per well)."
    },
    {
      "id": "s28",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Calculate total collagen I–Matrigel solution needed (1 mL per well, 0.5 mL layer 1 + 0.5 mL layer 2)."
    },
    {
      "id": "s29",
      "op": "manipulate",
      "inputs": [
        "e14"
      ],
      "outputs": [],
      "params": {
        "action": "thaw on ice"
      },
      "notes": "Thaw the required Matrigel aliquots on ice."
    },
    {
      "id": "s30",
      "op": "manipulate",
      "inputs": [
        "e12",
        "e13"
      ],
      "outputs": [],
      "params": {
        "action": "mix by pipetting up and down after adding PureCol"
      },
      "notes": "Pipette the collagen I solution as described and mix."
    },
    {
      "id": "s31",
      "op": "transfer",
      "inputs": [
        "e12"
      ],
      "outputs": [
        "e23"
      ],
      "params": {
        "instrument": "e25",
        "destination": "e23",
        "action": "place on ice"
      },
      "notes": "Pipette the exact amount of collagen I solution into a fresh 15‑mL Falcon tube and place on ice."
    },
    {
      "id": "s32",
      "op": "manipulate",
      "inputs": [
        "e14"
      ],
      "outputs": [],
      "params": {
        "action": "add Matrigel to collagen I solution and mix thoroughly"
      },
      "notes": ""
    },
    {
      "id": "s33",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "volume": "0.5 mL per well",
        "destination": "e22"
      },
      "notes": "Add 0.5 mL of collagen I/Matrigel solution per 12‑well plate and swirl to distribute."
    },
    {
      "id": "s34",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "2 h",
        "temperature": "37 °C"
      },
      "notes": "Incubate the plate at 37 °C for 2 h for solidification."
    },
    {
      "id": "s35",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e25",
        "destination": "e23"
      },
      "notes": "Pipette the aggregates into 15‑mL tubes with a 10‑mL serological pipette. Collect aggregates by gravitation."
    },
    {
      "id": "s36",
      "op": "manipulate",
      "inputs": [
        "e15"
      ],
      "outputs": [],
      "params": {
        "action": "wash aggregates",
        "volume": "1 mL",
        "repetitions": "2"
      },
      "notes": "Wash the aggregates by aspirating the supernatant and adding 1 mL StemPro‑34 SFM complete medium. Repeat once."
    },
    {
      "id": "s37",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e33",
        "action": "aspirate remaining medium"
      },
      "notes": "Use a P200 pipette to aspirate the medium; remove all remaining medium carefully."
    },
    {
      "id": "s38",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "For the second layer, add PureCol to prepare complete collagen I solution and keep on ice."
    },
    {
      "id": "s39",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "resuspend aggregates in collagen I–Matrigel solution",
        "temperature": "on ice"
      },
      "notes": ""
    },
    {
      "id": "s40",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e25",
        "action": "add 0.5 mL of cell‑aggregate‑collagen I–Matrigel solution to each well of the 12‑well plate"
      },
      "notes": "Remove the 12‑well plate containing the first layer and carefully add 0.5 mL of cell‑aggregate‑collagen I–Matrigel solution to each well."
    },
    {
      "id": "s41",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "distribute aggregates by rocking plate back and forth"
      },
      "notes": "Distribute the aggregates in the wells by rocking the plate back and forth, then move the plate to the incubator."
    },
    {
      "id": "s42",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "2 h",
        "temperature": "37 °C"
      },
      "notes": "Incubate the 12‑well plate for 2 h at 37 °C for gel solidification."
    },
    {
      "id": "s43",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e32",
        "action": "add prewarmed StemPro‑34 SFM complete medium with 15% FBS, 100 ng/mL VEGF‑A and 100 ng/mL FGF‑2"
      },
      "notes": "Add prewarmed (37 °C) StemPro‑34 SFM complete medium including 15% FBS, 100 ng/mL VEGF‑A and 100 ng/mL FGF‑2 to induce blood vessel differentiation."
    },
    {
      "id": "s44",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Change the medium after 3 d and then every other day."
    },
    {
      "id": "s45",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "On day 10, proceed to analysis of blood vessel networks (staining) or to grow/fix vascular organoid cultures."
    },
    {
      "id": "s46",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Fix vascular networks (option A) or grow and fix vascular organoids (option B)."
    },
    {
      "id": "s47",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e32",
        "action": "aspirate medium from a well"
      },
      "notes": "Aspirate the medium from a well using a P1000 pipette."
    },
    {
      "id": "s48",
      "op": "transfer",
      "inputs": [
        "e17"
      ],
      "outputs": [],
      "params": {
        "volume": "add 4% PFA solution in PBS",
        "duration": "20 min",
        "temperature": "room temperature"
      },
      "notes": "Add 4% paraformaldehyde (PFA) solution in PBS for 20 min at room temperature."
    },
    {
      "id": "s49",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "remove PFA solution and add PBS"
      },
      "notes": "Remove the PFA solution and add PBS."
    },
    {
      "id": "s50",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Fixed blood vessel networks can be kept in PBS in the refrigerator for up to 1 month (seal with Parafilm)."
    },
    {
      "id": "s51",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e35",
        "action": "cut gels into smaller pieces (1/4–1/2 of a 12‑well gel) using extra‑fine scissors and fine forceps"
      },
      "notes": ""
    },
    {
      "id": "s52",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e35",
        "destination": "e26",
        "action": "transfer gel fragments to a fresh 2‑mL Eppendorf tube"
      },
      "notes": ""
    },
    {
      "id": "s53",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e32",
        "action": "liberate entire matrix from well bottom using sterile spatula"
      },
      "notes": "Option B: liberate the entire matrix from the well bottom."
    },
    {
      "id": "s54",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e32",
        "destination": "e28",
        "action": "transfer gel with sterile lab spoon to lid of a 10‑cm dish"
      },
      "notes": ""
    },
    {
      "id": "s55",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e35",
        "action": "cut out single blood vessel networks with two sterile 30‑gauge needles"
      },
      "notes": ""
    },
    {
      "id": "s56",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e32",
        "destination": "e21",
        "volume": "5 mL",
        "action": "add StemPro‑34 SFM complete medium with 15% FBS, 100 ng/mL VEGF‑A, 100 ng/mL FGF‑2"
      },
      "notes": "Transfer single organoids to a 6‑well low‑attachment plate and incubate."
    },
    {
      "id": "s57",
      "op": "transfer",
      "inputs": [],
      "outputs": [],
      "params": {
        "instrument": "e32",
        "destination": "e27",
        "action": "transfer single organoids to low‑attachment round‑bottom 96‑well ultra‑low‑attachment plates",
        "add_medium": "StemPro‑34 SFM complete medium with 15% FBS, 100 ng/mL VEGF‑A"
      },
      "notes": "One day after separating the blood vessel networks (d11), transfer single organoids to 96‑well plates."
    }
  ]
}