{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-021-00603-4",
    "title": "Procedure",
    "source": "Nature Protocols",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "2",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": true,
    "contamination_control": [
      "use sterile technique",
      "prewarm reagents as indicated"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "organoid culture",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "Matrigel",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "Organoid culture medium",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "127IdU stock (0.5 mM)",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "Protease inhibitor cocktail (100×)",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "PhosSTOP (40×)",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "4% (vol/vol) PFA",
      "properties": {
        "prewarmed": "37 °C"
      }
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "PBS",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "194cisplatin (0.25 µM) in PBS",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "TOBis barcodes (pre‑aliquoted)",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "reagent",
      "name": "2 mM glutathione/CSB",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "reagent",
      "name": "CSB (Cell Staining Buffer)",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "reagent",
      "name": "Dispase II (0.5 mg ml⁻¹)",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "reagent",
      "name": "Collagenase IV (0.2 mg ml⁻¹)",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "reagent",
      "name": "DNase I (0.2 mg ml⁻¹)",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "container",
      "name": "gentleMACS C‑Tube",
      "properties": {}
    },
    {
      "id": "e17",
      "type": "instrument",
      "name": "gentleMACS Octo dissociator",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "instrument",
      "name": "centrifuge",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "container",
      "name": "polypropylene FACS tube",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "instrument",
      "name": "rocker (≈45 rpm)",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "instrument",
      "name": "incubator (37 °C, 5 % CO₂)",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "instrument",
      "name": "Countess II automated cell counter",
      "properties": {}
    },
    {
      "id": "e23",
      "type": "reagent",
      "name": "Extracellular antibody cocktail (in CSB)",
      "properties": {}
    },
    {
      "id": "e24",
      "type": "reagent",
      "name": "Intracellular antibody cocktail (in CSB)",
      "properties": {}
    },
    {
      "id": "e25",
      "type": "reagent",
      "name": "0.1 % Triton X‑100/PBS",
      "properties": {}
    },
    {
      "id": "e26",
      "type": "reagent",
      "name": "50 % methanol/PBS (ice‑cold)",
      "properties": {}
    },
    {
      "id": "e27",
      "type": "reagent",
      "name": "1.6 % FA/PBS (fresh from 16 % FA)",
      "properties": {}
    },
    {
      "id": "e28",
      "type": "reagent",
      "name": "Cell‑ID Intercalator‑Ir (125 µM stock)",
      "properties": {}
    },
    {
      "id": "e29",
      "type": "reagent",
      "name": "Fix & Perm buffer",
      "properties": {}
    },
    {
      "id": "e30",
      "type": "instrument",
      "name": "Helios mass cytometer",
      "properties": {}
    },
    {
      "id": "e31",
      "type": "reagent",
      "name": "EQ beads",
      "properties": {}
    },
    {
      "id": "e32",
      "type": "reagent",
      "name": "EDTA (2 mM final)",
      "properties": {}
    },
    {
      "id": "e33",
      "type": "reagent",
      "name": "MaxPar water",
      "properties": {}
    },
    {
      "id": "e34",
      "type": "instrument",
      "name": "Super Sampler (Victorian Airships)",
      "properties": {}
    },
    {
      "id": "e35",
      "type": "instrument",
      "name": "computer (for Fluidigm CyTOF software, MATLAB, Conda, CyGNAL)",
      "properties": {}
    },
    {
      "id": "e36",
      "type": "container",
      "name": "35‑µm cell strainer",
      "properties": {}
    },
    {
      "id": "e37",
      "type": "container",
      "name": "70‑µm cell strainer",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "manipulate",
      "inputs": [
        "e2",
        "e3",
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "well_volume": {
          "Matrigel": "50 µl",
          "medium": "200 µl"
        },
        "plate_type": "96‑well tissue culture plate"
      },
      "notes": "Culture organoids (or organoid co‑cultures) in 50 µl of Matrigel and 200 µl of medium."
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e4"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "10 µl",
        "final_concentration": "25 µM",
        "target": "culture medium"
      },
      "notes": "Add 127IdU directly to culture medium to a final concentration of 25 µM (10 µl of 0.5 mM stock added to 200 µl of medium)."
    },
    {
      "id": "s2b",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "rotate",
        "times": 5,
        "duration": "10 s"
      },
      "notes": "Gently rotate the plate by hand five times for 10 s to mix the medium."
    },
    {
      "id": "s2c",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "25 min",
        "temperature": "37 °C",
        "CO2": "5 %"
      },
      "notes": "Incubate the plate for 25 min at 37 °C and 5 % CO₂."
    },
    {
      "id": "s3",
      "op": "transfer",
      "inputs": [
        "e5",
        "e6"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "add directly to culture medium"
      },
      "notes": "Add the protease inhibitor cocktail (100×) and PhosSTOP (40×) directly to culture medium."
    },
    {
      "id": "s3b",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "rotate",
        "times": 5,
        "duration": "10 s"
      },
      "notes": "Gently rotate the plate by hand five times for 10 s."
    },
    {
      "id": "s3c",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "5 min",
        "temperature": "37 °C",
        "CO2": "5 %"
      },
      "notes": "Incubate for 5 min at 37 °C and 5 % CO₂."
    },
    {
      "id": "s4",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e7"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "remove medium",
        "add_volume": "200 µl",
        "prewarm": "37 °C"
      },
      "notes": "Remove culture medium by pipetting. Add 200 µl of pre‑warmed (37 °C) 4 % (vol/vol) PFA into each well, taking care not to disrupt Matrigel."
    },
    {
      "id": "s4b",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "60 min",
        "temperature": "37 °C",
        "CO2": "5 %"
      },
      "notes": "Incubate for 60 min at 37 °C and 5 % CO₂."
    },
    {
      "id": "s5",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e8",
        "e20"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "wash",
        "wash_volume": "200 µl",
        "rocker_speed": "~45 rpm",
        "wash_time": "10 min",
        "temperature": "room temperature"
      },
      "notes": "Remove PFA solution by pipetting, taking care not to disturb the Matrigel. Wash the cells with PBS on a rocker (≈45 rpm) for 10 min at room temperature. Repeat the wash."
    },
    {
      "id": "s5b",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: Fixed cells can be kept at 4 °C in PBS. Determine maximal storage time for your system."
    },
    {
      "id": "s6",
      "op": "transfer",
      "inputs": [
        "e9"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "200 µl",
        "target": "well"
      },
      "notes": "Remove PBS by pipetting. Add 200 µl of 0.25 µM 194cisplatin/PBS solution to each well and incubate for 10–15 min on a rocker at room temperature."
    },
    {
      "id": "s6b",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "10–15 min",
        "temperature": "room temperature"
      },
      "notes": ""
    },
    {
      "id": "s7",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e8",
        "e20"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "wash",
        "wash_volume": "200 µl",
        "rocker_speed": "~45 rpm",
        "wash_time": "10 min",
        "temperature": "room temperature"
      },
      "notes": "Remove the 194cisplatin solution by pipetting. Wash cells with PBS on a rocker for 10 min at room temperature. Repeat the wash."
    },
    {
      "id": "s7b",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Proceed to the next steps on the same day. Long‑term storage of cisplatin‑stained cells in situ will lead to overstaining."
    },
    {
      "id": "s8",
      "op": "transfer",
      "inputs": [
        "e10"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "200 µl",
        "target": "corresponding organoid samples"
      },
      "notes": "Transfer 200 µl of pre‑aliquoted TOBis barcodes to corresponding organoid samples in a 96‑well plate. Incubate the cells overnight at 4 °C."
    },
    {
      "id": "s8b",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "overnight",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s9",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e11",
        "e20"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "wash",
        "wash_volume": "200 µl",
        "rocker_speed": "~45 rpm",
        "wash_time": "10 min",
        "temperature": "room temperature",
        "repetitions": 3
      },
      "notes": "Remove the barcoding solutions by pipetting and wash the cells with 200 µl of 2 mM glutathione/CSB for 10 min on a rocker at room temperature. Repeat the wash twice."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e8",
        "e20"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "wash",
        "wash_volume": "200 µl",
        "rocker_speed": "~45 rpm",
        "wash_time": "10 min",
        "temperature": "room temperature",
        "repetitions": 2
      },
      "notes": "Wash the cells with 200 µl of PBS for 10 min on a rocker at room temperature. Repeat the wash."
    },
    {
      "id": "s10b",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: The barcoded cells can be kept at 4 °C for ≤4 weeks in PBS."
    },
    {
      "id": "s11",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e13",
        "e14",
        "e15"
      ],
      "params": {
        "solution": "dissociation buffer",
        "components": {
          "dispase II": "0.5 mg ml⁻¹",
          "collagenase IV": "0.2 mg ml⁻¹",
          "DNase I": "0.2 mg ml⁻¹"
        },
        "solvent": "PBS",
        "temperature": "room temperature"
      },
      "notes": "Make up a dissociation solution of fresh 0.5 mg ml⁻¹ dispase II, 0.2 mg ml⁻¹ collagenase IV and 0.2 mg ml⁻¹ DNase I in PBS at room temperature."
    },
    {
      "id": "s12",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e13",
        "e14",
        "e15"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "remove PBS",
        "add_solution": "dissociation buffer"
      },
      "notes": "Remove PBS from the wells by pipetting and add the dissociation solution."
    },
    {
      "id": "s13",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e16"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "action": "scrape Matrigel droplets and pool cells",
        "final_volume": "5 ml"
      },
      "notes": "Scrape Matrigel droplets and pool all cells from all conditions with dissociation solution to a gentleMACS C‑Tube. Top up the dissociation solution to 5 ml per C‑Tube."
    },
    {
      "id": "s14",
      "op": "run_device",
      "inputs": [
        "e16",
        "e17"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "program": "Standard protocol",
        "device": "gentleMACS Octo dissociator",
        "duration": "~50 min"
      },
      "notes": "Dissociate organoids into single cells using a gentleMACS Octo dissociator with the ‘Standard protocol’."
    },
    {
      "id": "s15",
      "op": "centrifuge",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "speed": "800 g",
        "duration": "1 min",
        "temperature": "room temperature"
      },
      "notes": "Centrifuge the C‑Tubes at 800 g for 1 min at room temperature to collect the cells."
    },
    {
      "id": "s16",
      "op": "transfer",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "target": "polypropylene FACS tube"
      },
      "notes": "Transfer all cells and solution to a polypropylene FACS tube."
    },
    {
      "id": "s17",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Centrifuge cells at 800 g for 5 min at room temperature and discard the supernatant."
    },
    {
      "id": "s18",
      "op": "manipulate",
      "inputs": [
        "e19",
        "e12"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "action": "wash",
        "wash_volume": "2 ml",
        "repetitions": 2,
        "speed": "800 g",
        "duration": "5 min"
      },
      "notes": "Wash cells with 2 ml of CSB, centrifuge at 800 g for 5 min at room temperature and discard the supernatant. Repeat the wash."
    },
    {
      "id": "s19",
      "op": "manipulate",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "action": "filter",
        "filter_type": "cell strainer",
        "volume": "2 ml"
      },
      "notes": "Resuspend cells in 2 ml of CSB and filter through a cell strainer to remove residual clumps. Use 35‑µm strainers for monocultures and 70‑µm strainers for cultures containing fibroblasts."
    },
    {
      "id": "s20",
      "op": "measure",
      "inputs": [
        "e19"
      ],
      "outputs": [],
      "params": {
        "instrument": "Countess II automated cell counter"
      },
      "notes": "Count cells using the Countess II automated cell counter. Up to ~4.5 × 10⁶ cells can be taken forward for 1× MC staining."
    },
    {
      "id": "s21",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Centrifuge cells at 800 g for 5 min at room temperature, discard the supernatant and resuspend cells in 50 µl of CSB."
    },
    {
      "id": "s22",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e23"
      ],
      "params": {
        "solution": "extracellular antibody cocktail",
        "volume": "up to 50 µl",
        "buffer": "CSB"
      },
      "notes": "Prepare extracellular antibody cocktail by mixing the antibody panel in CSB (total volume up to 50 µl)."
    },
    {
      "id": "s23",
      "op": "transfer",
      "inputs": [
        "e23"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "volume": "up to 50 µl",
        "mix_method": "pipette"
      },
      "notes": "Add the extracellular antibody cocktail to the cells, mix thoroughly by pipetting and incubate for 30 min on a rocker at room temperature. Mix cells by gently flicking the tube every 10 min."
    },
    {
      "id": "s24",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Add 2 ml of CSB to the cells, centrifuge at 800 g for 5 min at room temperature and discard the supernatant."
    },
    {
      "id": "s25",
      "op": "manipulate",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "solution": "0.1 % Triton X‑100/PBS",
        "volume": "1 ml",
        "vortex": true,
        "incubation": {
          "duration": "30 min",
          "temperature": "room temperature",
          "rocker": true
        },
        "mix_interval": "10 min"
      },
      "notes": "Resuspend cells in 1 ml of 0.1 % (vol/vol) Triton X‑100/PBS, gently vortex and incubate for 30 min on a rocker at room temperature. Mix cells by gently flicking the tube every 10 min."
    },
    {
      "id": "s26",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature",
        "repetitions": 2
      },
      "notes": "Add 2 ml of CSB to the cells, centrifuge at 800 g for 5 min at room temperature and discard the supernatant. Repeat the wash and remove the supernatant."
    },
    {
      "id": "s27",
      "op": "manipulate",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "action": "place on ice",
        "duration": "1 min"
      },
      "notes": "Place the cells on ice for 1 min."
    },
    {
      "id": "s28",
      "op": "manipulate",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "solution": "50 % methanol/PBS (ice‑cold)",
        "volume": "1 ml",
        "vortex": true,
        "incubation": {
          "duration": "10 min",
          "temperature": "ice"
        }
      },
      "notes": "Resuspend cells in 1 ml of ice‑cold 50 % (vol/vol) methanol/PBS, gently vortex and incubate for 10 min on ice."
    },
    {
      "id": "s29",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature",
        "repetitions": 2
      },
      "notes": "Add 2 ml of CSB to the cells, centrifuge at 800 g for 5 min at room temperature and discard the supernatant. Repeat the wash."
    },
    {
      "id": "s30",
      "op": "manipulate",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "action": "resuspend",
        "volume": "50 µl",
        "buffer": "CSB"
      },
      "notes": "Resuspend cells in 50 µl of CSB."
    },
    {
      "id": "s31",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e24"
      ],
      "params": {
        "solution": "intracellular antibody cocktail",
        "volume": "up to 50 µl",
        "buffer": "CSB"
      },
      "notes": "Prepare intracellular antibody cocktail by mixing the antibody panel in CSB (total volume up to 50 µl)."
    },
    {
      "id": "s32",
      "op": "transfer",
      "inputs": [
        "e24"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "volume": "up to 50 µl",
        "mix_method": "pipette"
      },
      "notes": "Add the intracellular antibody cocktail to the cells, mix thoroughly by pipetting and incubate for 30 min on a rocker at room temperature. Mix cells by gently flicking the tube every 10 min."
    },
    {
      "id": "s33",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Add 2 ml of CSB to the cells, centrifuge at 800 g for 5 min at room temperature and discard the supernatant."
    },
    {
      "id": "s34",
      "op": "manipulate",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "solution": "1.6 % FA/PBS",
        "volume": "1 ml",
        "incubation": {
          "duration": "10 min",
          "temperature": "room temperature",
          "rocker": true
        }
      },
      "notes": "Add 1 ml of 1.6 % (vol/vol) FA/PBS solution (made fresh from 16 % FA) to the cells and incubate for 10 min on a rocker at room temperature."
    },
    {
      "id": "s35",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Add 2 ml of CSB to the cells, centrifuge at 800 g for 5 min at room temperature and discard the supernatant."
    },
    {
      "id": "s36",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e28"
      ],
      "params": {
        "solution": "intercalation buffer",
        "components": {
          "Cell‑ID Intercalator‑Ir": "1 µl of 125 µM",
          "Fix & Perm buffer": "1 ml"
        },
        "final_concentration": "125 nM"
      },
      "notes": "Prepare intercalation buffer by diluting 1 µl of 125 µM Cell‑ID Intercalator‑Ir in 1 ml of Fix & Perm buffer (final concentration = 125 nM)."
    },
    {
      "id": "s37",
      "op": "manipulate",
      "inputs": [
        "e19",
        "e28"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "volume": "1 ml",
        "vortex": true,
        "incubation": {
          "duration": "1 h",
          "temperature": "room temperature",
          "rocker": true
        },
        "alternative": "overnight at 4 °C"
      },
      "notes": "Resuspend cells in 1 ml of intercalation buffer, gently vortex and incubate for 1 h on a rocker at room temperature or overnight at 4 °C."
    },
    {
      "id": "s38",
      "op": "run_device",
      "inputs": [
        "e30"
      ],
      "outputs": [],
      "params": {
        "action": "tune mass cytometer"
      },
      "notes": "Tune the Helios mass cytometer (see Equipment setup)."
    },
    {
      "id": "s39",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Centrifuge cells at 800 g for 5 min at room temperature and discard the supernatant."
    },
    {
      "id": "s40",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "solution": "2 mM EDTA/CSB",
        "volume": "2 ml",
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Wash the cells with 2 ml of 2 mM EDTA/CSB, centrifuge at 800 g for 5 min at room temperature and discard the supernatant."
    },
    {
      "id": "s41",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "solution": "CSB",
        "volume": "2 ml",
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Wash cells with 2 ml of CSB, centrifuge at 800 g for 5 min at room temperature and discard the supernatant."
    },
    {
      "id": "s42",
      "op": "centrifuge",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "solution": "MaxPar water",
        "volume": "2 ml",
        "speed": "800 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": "Wash cells with 2 ml of MaxPar water, centrifuge at 800 g for 5 min at room temperature and discard the supernatant."
    },
    {
      "id": "s43",
      "op": "manipulate",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "solution": "MaxPar water",
        "volume": "1 ml",
        "filter": "35‑µm cell strainer (or 70‑µm for fibroblast‑containing cultures)",
        "count_method": "Countess II"
      },
      "notes": "Resuspend cells in 1 ml of MaxPar water, filter through a 35‑µm cell strainer (70 µm when the culture contains fibroblasts) and count the cells using a Countess II automated cell counter."
    },
    {
      "id": "s44",
      "op": "manipulate",
      "inputs": [
        "e19"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "target_concentration": "0.8–1.2 ×10⁶ cells ml⁻¹",
        "diluent": "MaxPar water"
      },
      "notes": "Dilute cells to ~0.8–1.2 × 10⁶ cells ml⁻¹ in MaxPar water."
    },
    {
      "id": "s45",
      "op": "transfer",
      "inputs": [
        "e31"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "ratio": "1:5",
        "target": "cell suspension"
      },
      "notes": "Add EQ beads to the cell suspension at a volumetric ratio of 1:5."
    },
    {
      "id": "s46",
      "op": "transfer",
      "inputs": [
        "e32"
      ],
      "outputs": [
        "e19"
      ],
      "params": {
        "final_concentration": "2 mM",
        "target": "cell suspension"
      },
      "notes": "Add EDTA to the cells to a final concentration of 2 mM."
    },
    {
      "id": "s47",
      "op": "run_device",
      "inputs": [
        "e34",
        "e30"
      ],
      "outputs": [],
      "params": {
        "action": "set up Super Sampler and acquisition parameters"
      },
      "notes": "Set up the ‘Super Sampler’ (Victorian Airships) as per the manufacturer’s instructions, and set up acquisition parameters (e.g., antibody panel and experiment metadata) on the Helios mass cytometer."
    },
    {
      "id": "s48",
      "op": "run_device",
      "inputs": [
        "e30"
      ],
      "outputs": [],
      "params": {
        "action": "acquire events",
        "target_rate": "100–400 events/s"
      },
      "notes": "Acquire events on the Helios mass cytometer using the Fluidigm CyTOF software. Aim for 100–400 events/s."
    },
    {
      "id": "s49",
      "op": "observe",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "Fluidigm CyTOF software",
        "action": "process raw data and export FCS"
      },
      "notes": "After acquisition, process the raw data with the Fluidigm CyTOF software (signal normalization, removal of EQ beads, concatenation if needed) and export data as FCS file(s)."
    },
    {
      "id": "s50",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "MATLAB Zunder Lab Single Cell Debarcoder",
        "action": "debarcode FCS files"
      },
      "notes": "Debarcode multiplexed FCS file(s) into separate experimental conditions using the MATLAB program Zunder Lab Single Cell Debarcoder with user‑defined TOBis barcode keys."
    },
    {
      "id": "s51",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Download CyGNAL v0.2.1 from GitHub (https://github.com/TAPE-Lab/CyGNAL/releases/tag/v0.2.1) and open a terminal session from the repository folder."
    },
    {
      "id": "s52",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {
        "commands": [
          "conda env create -f conda_env.yml",
          "conda activate cygnal"
        ]
      },
      "notes": "Set up the computing environment (recommended Conda) by running the provided commands."
    },
    {
      "id": "s53",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "Cytobank or equivalent",
        "action": "import debarcoded FCS files"
      },
      "notes": "Import debarcoded FCS files to the Cytobank platform or an equivalent FCS processing software."
    },
    {
      "id": "s54",
      "op": "observe",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "Gaussian gating to remove debris"
      },
      "notes": "Perform Gaussian gating to remove debris."
    },
    {
      "id": "s55",
      "op": "observe",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "DNA/cisplatin gating to identify cells"
      },
      "notes": "Perform DNA/cisplatin gating to identify cells."
    },
    {
      "id": "s56",
      "op": "observe",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "cell‑type gating to exclude doublets"
      },
      "notes": "Perform cell‑type gating to exclude doublets (cells positive for mutually exclusive cell‑type markers)."
    },
    {
      "id": "s57",
      "op": "observe",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "export dataset as FCS"
      },
      "notes": "Export the dataset as FCS files for downstream analysis."
    },
    {
      "id": "s58",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "CyGNAL",
        "script": "1-data_preprocess.py"
      },
      "notes": "Copy the cell‑comprised FCS file(s) to the Raw_Data folder, run python code/1-data_preprocess.py and follow the prompts. This generates preprocessed datasets and panel_markers.csv."
    },
    {
      "id": "s59",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "CyGNAL",
        "script": "2-umap.py"
      },
      "notes": "Copy CyGNAL‑processed dataset(s) and panel_markers.csv to Analysis/UMAP_input/, label markers for UMAP with ‘Y’, and run python code/2-umap.py."
    },
    {
      "id": "s60",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "CyGNAL",
        "script": "5v1-heatmap.py"
      },
      "notes": "Copy UMAP output to Analysis/Vis_Heatmap/ and run python code/5v1-heatmap.py for interactive heatmap visualization."
    },
    {
      "id": "s61",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "CyGNAL",
        "script": "5v2-pca.py"
      },
      "notes": "Copy UMAP output to Analysis/Vis_PCA/ and run python code/5v2-pca.py for PCA visualization."
    },
    {
      "id": "s62",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "CyGNAL",
        "script": "3-emd.py or 4-dremi.py"
      },
      "notes": "Copy CyGNAL‑processed, cell‑type‑specific dataset(s) and panel_markers.csv to Analysis/EMD_input/ or Analysis/DREMI_input/, label markers with ‘Y’, and run the appropriate script (3-emd.py or 4-dremi.py)."
    },
    {
      "id": "s63",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "CyGNAL",
        "script": "5v1-heatmap.py"
      },
      "notes": "Copy EMD/DREMI output to Analysis/Vis_Heatmap/ and run python code/5v1-heatmap.py to visualize scores as heatmaps."
    },
    {
      "id": "s64",
      "op": "run_device",
      "inputs": [],
      "outputs": [],
      "params": {
        "software": "CyGNAL",
        "script": "5v2-pca.py"
      },
      "notes": "Copy EMD/DREMI output to Analysis/Vis_PCA/ and run python code/5v2-pca.py to visualize scores via PCA."
    }
  ]
}