{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-021-00603-4",
    "title": "Multiplexed single-cell analysis of organoid signaling networks (TOBis MC)",
    "source": "https://doi.org/10.1038/s41596-021-00603-4",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": null,
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": false,
    "sterility_required": true,
    "contamination_control": []
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "Organoid culture (live)",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "5‑iodo‑2′‑deoxyuridine (IdU, 127)",
      "properties": {
        "catalog": "Fluidigm 201127"
      }
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "Protease inhibitor cocktail",
      "properties": {
        "catalog": "Sigma P8340"
      }
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "PhosSTOP phosphatase inhibitor cocktail",
      "properties": {
        "catalog": "Sigma 4906845001"
      }
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "4 % paraformaldehyde (PFA) in PBS",
      "properties": {
        "catalog": "Thermo Scientific J19943K2"
      }
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "Monoisotopic cisplatin (194 Pt or 198 Pt)",
      "properties": {
        "catalog": "Fluidigm 201194 / 201198"
      }
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "TOBis barcode kit (TeMal isotopes + cisplatin)",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "Reduced glutathione (GSH)",
      "properties": {
        "catalog": "Sigma G6529"
      }
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "Dispase II",
      "properties": {
        "catalog": "Thermo Fisher 17105041"
      }
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "Collagenase IV",
      "properties": {
        "catalog": "Thermo Fisher 17104019"
      }
    },
    {
      "id": "e11",
      "type": "reagent",
      "name": "DNase I",
      "properties": {
        "catalog": "Sigma DN25"
      }
    },
    {
      "id": "e12",
      "type": "reagent",
      "name": "Metal‑conjugated extracellular antibodies",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "reagent",
      "name": "0.1 % Triton X‑100 (vol/vol)",
      "properties": {
        "catalog": "Sigma T8787"
      }
    },
    {
      "id": "e14",
      "type": "reagent",
      "name": "50 % methanol (vol/vol)",
      "properties": {
        "catalog": "Fisher 10675112"
      }
    },
    {
      "id": "e15",
      "type": "reagent",
      "name": "Metal‑conjugated intracellular antibodies (PTM & cell‑state)",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "reagent",
      "name": "Formaldehyde (FA) 1.6 % (wt/vol)",
      "properties": {
        "catalog": "Pierce 28906"
      }
    },
    {
      "id": "e17",
      "type": "reagent",
      "name": "Cell‑ID Intercalator‑Ir (191/193 Ir)",
      "properties": {
        "catalog": "Fluidigm 201192A"
      }
    },
    {
      "id": "e18",
      "type": "reagent",
      "name": "EQ calibration beads",
      "properties": {
        "catalog": "Fluidigm 201078"
      }
    },
    {
      "id": "e19",
      "type": "reagent",
      "name": "EDTA (2 mM final)",
      "properties": {
        "catalog": "Sigma 03690-100ML"
      }
    },
    {
      "id": "e20",
      "type": "container",
      "name": "96‑well plate (Matrigel culture)",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "container",
      "name": "C‑tube (gentleMACS)",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "instrument",
      "name": "gentleMACS Octo dissociator",
      "properties": {
        "manufacturer": "Miltenyi",
        "model": "130-096-427"
      }
    },
    {
      "id": "e23",
      "type": "instrument",
      "name": "Helios mass cytometer",
      "properties": {
        "manufacturer": "Fluidigm"
      }
    },
    {
      "id": "e24",
      "type": "instrument",
      "name": "Super Sampler (Victorian Airships)",
      "properties": {}
    },
    {
      "id": "e25",
      "type": "instrument",
      "name": "Countess II cell counter",
      "properties": {
        "manufacturer": "Thermo Fisher"
      }
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "transfer",
      "inputs": [
        "e1",
        "e2"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "as required",
        "incubation_time": "30 min before endpoint"
      },
      "notes": "Add 127‑IdU to live organoid culture to label S‑phase cells."
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e1",
        "e3",
        "e4"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "incubation_time": "5 min before endpoint"
      },
      "notes": "Add protease and phosphatase inhibitor cocktails to protect epitopes."
    },
    {
      "id": "s3",
      "op": "incubate",
      "inputs": [
        "e1",
        "e5"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "temperature": "37 °C",
        "time": "60 min",
        "method": "in situ fixation in Matrigel"
      },
      "notes": "Fix organoids while still embedded in Matrigel."
    },
    {
      "id": "s4",
      "op": "transfer",
      "inputs": [
        "e1",
        "e6"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "incubation_time": "10–15 min",
        "wash": "PBS after staining"
      },
      "notes": "Stain fixed organoids with monoisotopic cisplatin to identify dead/dying cells."
    },
    {
      "id": "s5",
      "op": "incubate",
      "inputs": [
        "e1",
        "e7"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "temperature": "4 °C",
        "time": "overnight",
        "method": "add TOBis barcodes while organoids remain in Matrigel"
      },
      "notes": "Barcoding of organoids in situ."
    },
    {
      "id": "s6",
      "op": "wash",
      "inputs": [
        "e1",
        "e8"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "wash_buffer": "PBS with reduced glutathione",
        "repeat": 2
      },
      "notes": "Quench unbound thiol‑reactive barcodes with reduced glutathione and wash."
    },
    {
      "id": "s7",
      "op": "transfer",
      "inputs": [
        "e1",
        "e9",
        "e10",
        "e11"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "buffer": "dissociation buffer (Dispase II, Collagenase IV, DNase I)",
        "volume": "as needed"
      },
      "notes": "Remove organoids from Matrigel, resuspend in dissociation buffer."
    },
    {
      "id": "s8",
      "op": "run_device",
      "inputs": [
        "e21",
        "e22"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "program": "Standard protocol custom program",
        "heater_temperature": "37 °C",
        "steps": [
          {
            "action": "forward_spin",
            "rpm": 20,
            "duration": "2 min"
          },
          {
            "action": "backward_spin",
            "rpm": 20,
            "duration": "2 min"
          },
          {
            "loop": 15,
            "actions": [
              {
                "action": "forward_spin",
                "rpm": 1500,
                "duration": "2 s"
              },
              {
                "action": "backward_spin",
                "rpm": 1500,
                "duration": "2 s"
              },
              {
                "action": "forward_spin",
                "rpm": 50,
                "duration": "3 min"
              }
            ]
          }
        ]
      },
      "notes": "Dissociate organoids into a single‑cell suspension using gentleMACS Octo."
    },
    {
      "id": "s9",
      "op": "manipulate",
      "inputs": [
        "e21"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "action": "filter",
        "filter_size": "40 µm"
      },
      "notes": "Filter cell suspension to remove clumps."
    },
    {
      "id": "s10",
      "op": "transfer",
      "inputs": [
        "e21",
        "e12"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "incubation_time": "as per antibody panel",
        "temperature": "4 °C"
      },
      "notes": "Stain cells with metal‑conjugated extracellular antibodies."
    },
    {
      "id": "s11",
      "op": "manipulate",
      "inputs": [
        "e21",
        "e13",
        "e14"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "method": "permeabilization",
        "Triton_X100": "0.1 % vol/vol",
        "methanol": "50 % vol/vol"
      },
      "notes": "Permeabilize cells for intracellular staining."
    },
    {
      "id": "s12",
      "op": "transfer",
      "inputs": [
        "e21",
        "e15"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "incubation_time": "as per antibody panel",
        "temperature": "4 °C"
      },
      "notes": "Stain intracellular PTM and cell‑state antibodies."
    },
    {
      "id": "s13",
      "op": "incubate",
      "inputs": [
        "e21",
        "e16"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "concentration": "1.6 % wt/vol",
        "time": "10 min",
        "temperature": "RT"
      },
      "notes": "Cross‑link antibodies to antigens with formaldehyde."
    },
    {
      "id": "s14",
      "op": "incubate",
      "inputs": [
        "e21",
        "e17"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "time": "overnight",
        "temperature": "RT"
      },
      "notes": "Incubate cells with 191/193 Ir DNA intercalator."
    },
    {
      "id": "s15",
      "op": "transfer",
      "inputs": [
        "e21",
        "e19",
        "e18"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "buffer": "water with 2 mM EDTA",
        "cell_concentration": "0.8–1.2 × 10⁶ cells / ml",
        "add_beads": "EQ calibration beads"
      },
      "notes": "Prepare cells for acquisition."
    },
    {
      "id": "s16",
      "op": "run_device",
      "inputs": [
        "e21",
        "e23",
        "e24"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "mode": "Event",
        "flow_rate": "30 µl/min",
        "injector": "Wide Bore",
        "acquisition_time": "as required"
      },
      "notes": "Acquire single‑cell data on Helios mass cytometer using Super Sampler."
    },
    {
      "id": "s17",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Data analysis: normalize FCS files, debarcode TOBis barcodes, gate debris/live/doublets, perform UMAP, calculate EMD and DREMI using CyGNAL pipeline (software versions as listed in protocol)."
    }
  ]
}