{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-020-0379-4",
    "title": "Protocol",
    "source": "Nature Protocols",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "BSL-2",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": true,
    "contamination_control": [
      "mycoplasma testing",
      "use of antibiotics in culture medium"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "patient tissue pieces",
      "properties": {
        "origin": "surgical resection or biopsy",
        "status": "viable (pink) tissue"
      }
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "ROCK inhibitor Y-27632",
      "properties": {
        "concentration_stock": "100 mM",
        "final_concentration": "10 µM",
        "catalog": "Abmole Bioscience, cat. no. M1817"
      }
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "collagenase (or Liberase)",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "DNase",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "dispase II protease",
      "properties": {
        "catalog": "Sigma-Aldrich, cat. no. D4693"
      }
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "BME (basement membrane extract) Type 2",
      "properties": {
        "catalog": "R&D Systems, cat. no. 3533-005-02"
      }
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "Matrigel, growth factor reduced, phenol red‑free",
      "properties": {
        "catalog": "BD, cat. no. 356231"
      }
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "CellTiter‑Glo 3D reagent",
      "properties": {
        "catalog": "Promega, cat. no. G9681"
      }
    },
    {
      "id": "e9",
      "type": "instrument",
      "name": "Biosafety cabinet",
      "properties": {
        "model": "Telstar BioVanguard Green Line"
      }
    },
    {
      "id": "e10",
      "type": "instrument",
      "name": "CO₂ incubator",
      "properties": {
        "model": "Panasonic MCO-19AICUV-PE",
        "temperature": "37 °C",
        "CO₂": "5% (vol/vol)"
      }
    },
    {
      "id": "e11",
      "type": "instrument",
      "name": "Light microscope",
      "properties": {
        "model": "Nikon Eclipse TS100"
      }
    },
    {
      "id": "e12",
      "type": "instrument",
      "name": "Multidrop Combi reagent dispenser",
      "properties": {
        "catalog": "Thermo Scientific, cat. no. 5840400"
      }
    },
    {
      "id": "e13",
      "type": "instrument",
      "name": "Digital dispenser D300e",
      "properties": {
        "manufacturer": "Tecan",
        "model": "D300e"
      }
    },
    {
      "id": "e14",
      "type": "instrument",
      "name": "Luminescence detector",
      "properties": {
        "example_model": "Tecan SPARK"
      }
    },
    {
      "id": "e15",
      "type": "container",
      "name": "384‑well ultra‑low attachment plate",
      "properties": {
        "catalog": "Corning, cat. no. 4588"
      }
    },
    {
      "id": "e16",
      "type": "container",
      "name": "Cryogenic vial (1 ml)",
      "properties": {
        "catalog": "Greiner Bio‑One, cat. no. 123263"
      }
    },
    {
      "id": "e17",
      "type": "container",
      "name": "Conical tube, 15 ml",
      "properties": {
        "catalog": "Greiner Bio‑One, cat. no. 188271"
      }
    },
    {
      "id": "e18",
      "type": "reagent",
      "name": "Advanced DMEM/F12+++ medium",
      "properties": {
        "components": "adDMEM/F12 + 100 U ml⁻¹ penicillin‑streptomycin + 10 mM HEPES + 1× GlutaMAX"
      }
    },
    {
      "id": "e19",
      "type": "reagent",
      "name": "TrypLE Express Enzyme (1×)",
      "properties": {
        "catalog": "Thermo Fisher Scientific, cat. no. 12605-010"
      }
    },
    {
      "id": "e20",
      "type": "reagent",
      "name": "Positive control drug (staurosporin)",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "reagent",
      "name": "Negative control solvent (DMSO)",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e1"
      ],
      "params": {},
      "notes": "Obtain surgical resections or biopsies from patients (healthy oral mucosa or HNSCC)."
    },
    {
      "id": "s2",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "temperature": "4 °C",
        "medium": "ice‑cold basic medium",
        "additives": [
          "10 µM ROCK inhibitor Y‑27632"
        ]
      },
      "notes": "Store tissue pieces on ice in basic medium containing 10 µM Y‑27632 (or ice‑cold PBS) to minimize cell death; up to 72 h."
    },
    {
      "id": "s3",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "tool": "disposable scalpel, no. 10"
      },
      "notes": "Mechanically fragment tissue into ~1 mm pieces."
    },
    {
      "id": "s4",
      "op": "incubate",
      "inputs": [
        "e1",
        "e3",
        "e4"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "temperature": "37 °C",
        "duration": "30 min to overnight",
        "device": "water bath or incubator"
      },
      "notes": "Digest fragments with collagenase (or Liberase) ± DNase to obtain single‑cell suspension or small clumps. Check progress periodically."
    },
    {
      "id": "s5",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "filters": [
          "100 µm cell strainer",
          "70 µm cell strainer"
        ]
      },
      "notes": "Filter digested material sequentially through 100 µm then 70 µm strainers."
    },
    {
      "id": "s6",
      "op": "observe",
      "inputs": [
        "e1"
      ],
      "outputs": [],
      "params": {
        "instrument": "e11",
        "method": "hemocytometer counting"
      },
      "notes": "Count cells/organoids using a hemocytometer (Glasstic slide)."
    },
    {
      "id": "s7",
      "op": "transfer",
      "inputs": [
        "e1",
        "e6",
        "e7",
        "e18"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "plate_type": "384‑well ultra‑low attachment",
        "dispensing_device": "e12",
        "ECM_percentage": "5–10% (vol/vol) BME or Matrigel",
        "keep_cold": true,
        "tubing_prime": "cold PBS"
      },
      "notes": "Mix cell suspension with cold BME/Matrigel (5–10 % final) and dispense organoids into 384‑well plate using Multidrop dispenser."
    },
    {
      "id": "s8",
      "op": "incubate",
      "inputs": [
        "e15"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "device": "e10",
        "temperature": "37 °C",
        "CO₂": "5% (vol/vol)",
        "duration": "until ready for treatment (typically 1–5 d)",
        "medium_refresh_interval": "2–3 d",
        "additive_first_two_passages": "10 µM Y‑27632"
      },
      "notes": "Culture organoids in humidified incubator; refresh medium every 2–3 days."
    },
    {
      "id": "s9",
      "op": "manipulate",
      "inputs": [
        "e15",
        "e19"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "enzyme": "TrypLE",
        "monitor_interval": "5 min",
        "observation_tool": "e11",
        "desired_outcome": "clusters of 3–5 cells + single cells"
      },
      "notes": "For passaging, add TrypLE, monitor digestion, stop when appropriate cluster size observed; aid disruption with P1000 pipette."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "e15"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "alternative_method": "mechanical shearing with plugged glass Pasteur pipette"
      },
      "notes": "If organoids are cystic/grape‑like, use mechanical shearing instead of TrypLE."
    },
    {
      "id": "s11",
      "op": "manipulate",
      "inputs": [
        "e15"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "additive": "10 µM ROCK inhibitor Y‑27632"
      },
      "notes": "Add Y‑27632 directly after passaging; not required after medium refresh 2–3 d later."
    },
    {
      "id": "s12",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e16"
      ],
      "params": {},
      "notes": "Prepare cryogenic vials for freezing organoids."
    },
    {
      "id": "s13",
      "op": "manipulate",
      "inputs": [
        "e15",
        "e16"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "freezing_medium": "Recovery cell‑freezing medium",
        "time_post_passage": "2–3 d",
        "container": "e16",
        "freezing_device": "CoolCell LX",
        "storage": "liquid nitrogen tank"
      },
      "notes": "Freeze organoids when highly proliferative; aliquot into cryovials, place in controlled‑rate freezer, then store in liquid nitrogen."
    },
    {
      "id": "s14",
      "op": "manipulate",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "thaw_method": "rapid thaw at 37 °C",
        "post_thaw_culture": "at least one passage before screening"
      },
      "notes": "Thaw frozen organoids, wash, and culture; allow one passage before drug screening."
    },
    {
      "id": "s15",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Quality‑control steps (e.g., tumor purity assessment, mycoplasma testing, antibiotic supplementation) are recommended but not detailed here."
    },
    {
      "id": "s16",
      "op": "manipulate",
      "inputs": [
        "e15",
        "e5"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "additive": "dispase II",
        "purpose": "remove BME/Matrigel before screening"
      },
      "notes": "Add dispase to wells on day of screen to dissolve ECM."
    },
    {
      "id": "s17",
      "op": "manipulate",
      "inputs": [
        "e15"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "wash": true,
        "filter": "remove large organoids"
      },
      "notes": "Wash organoids, filter to exclude large organoids, then count and adjust density in medium containing 5% BME/Matrigel."
    },
    {
      "id": "s18",
      "op": "transfer",
      "inputs": [
        "e15"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "dispensing_device": "e12",
        "keep_cold": true
      },
      "notes": "Dispense organoid suspension into 384‑well plate (desired density) using Multidrop dispenser; keep suspension cold to prevent ECM clogging."
    },
    {
      "id": "s19",
      "op": "transfer",
      "inputs": [
        "e20",
        "e21"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "device": "e13",
        "layout": "digital dispenser D300e software layout (Fig. 3b)",
        "controls": {
          "positive": "staurosporin (or cycloheximide)",
          "negative": "DMSO"
        },
        "replicates": "minimum triplicate"
      },
      "notes": "Add drugs to wells using D300e; include positive and negative controls."
    },
    {
      "id": "s20",
      "op": "incubate",
      "inputs": [
        "e15"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "duration": "5 d (typical) or 1–24 d depending on assay",
        "temperature": "37 °C",
        "CO₂": "5% (vol/vol)"
      },
      "notes": "Incubate plates after drug addition."
    },
    {
      "id": "s21",
      "op": "transfer",
      "inputs": [
        "e8"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "dispensing_device": "e12",
        "volume_per_well": "as recommended by CellTiter‑Glo 3D protocol"
      },
      "notes": "Add CellTiter‑Glo 3D reagent to each well using Multidrop dispenser."
    },
    {
      "id": "s22",
      "op": "incubate",
      "inputs": [
        "e15"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "duration": "as per reagent protocol (lysis)",
        "temperature": "room temperature"
      },
      "notes": "Allow cell lysis for luminescence development."
    },
    {
      "id": "s23",
      "op": "observe",
      "inputs": [
        "e15"
      ],
      "outputs": [],
      "params": {
        "instrument": "e14",
        "measurement": "luminescence"
      },
      "notes": "Measure luminescence signal from each well."
    },
    {
      "id": "s24",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Data analysis performed in GraphPad Prism (IC₅₀, AUC, GR metrics). Alternative analysis software may be used."
    }
  ]
}