{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-020-0379-4",
    "title": "Organoid culture generation, drug screening and readout",
    "source": "Nature Protocols",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [
        "incubator",
        "centrifuge",
        "water bath",
        "multidrop dispenser",
        "digital drug dispenser",
        "luminescence plate reader"
      ],
      "action_kind": [
        "collect",
        "assess",
        "mince",
        "fix",
        "freeze",
        "digest",
        "mix",
        "pipette",
        "wash",
        "centrifuge",
        "filter",
        "resuspend",
        "plate",
        "incubate",
        "change medium",
        "split",
        "mechanical dissociation",
        "enzymatic dissociation",
        "pre‑warm",
        "store",
        "thaw",
        "dispense",
        "wash tubing",
        "calibrate",
        "add drug",
        "irradiate",
        "lyse",
        "shake",
        "measure",
        "analyze"
      ],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "2",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": true,
    "contamination_control": [
      "use of Primocin",
      "use of caspofungin for head/neck organoids"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "primary human tissue pieces",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "adDMEM/F12+++",
      "properties": {
        "temperature": "ice‑cold"
      }
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "10 µM ROCK inhibitor",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "container",
      "name": "50‑ml conical tube",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "instrument",
      "name": "4 °C refrigerator",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "10 % (wt/vol) formalin",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "4 % (wt/vol) paraformaldehyde",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "instrument",
      "name": "-80 °C freezer",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "instrument",
      "name": "dissection microscope",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "instrument",
      "name": "P1000 pipette",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "instrument",
      "name": "shaker",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "instrument",
      "name": "centrifuge",
      "properties": {
        "temperature": "4 °C"
      }
    },
    {
      "id": "e13",
      "type": "reagent",
      "name": "100‑µm cell strainer",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "reagent",
      "name": "70‑µm cell strainer",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "reagent",
      "name": "BME (or Matrigel)",
      "properties": {
        "state": "on ice"
      }
    },
    {
      "id": "e16",
      "type": "container",
      "name": "pre‑heated 24‑well suspension plate",
      "properties": {}
    },
    {
      "id": "e17",
      "type": "instrument",
      "name": "incubator (37 °C, 5 % CO₂, humidified)",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "reagent",
      "name": "organoid medium (tissue‑specific growth factors)",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "reagent",
      "name": "Primocin (100 µg ml⁻¹)",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "reagent",
      "name": "caspofungin (0.5 µg ml⁻¹, head/neck only)",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "container",
      "name": "15‑ml conical tube",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "reagent",
      "name": "TrypLE",
      "properties": {}
    },
    {
      "id": "e23",
      "type": "instrument",
      "name": "water bath (37 °C)",
      "properties": {}
    },
    {
      "id": "e24",
      "type": "reagent",
      "name": "cell‑freezing medium",
      "properties": {}
    },
    {
      "id": "e25",
      "type": "container",
      "name": "cryogenic vial",
      "properties": {}
    },
    {
      "id": "e26",
      "type": "instrument",
      "name": "freezing container (‑80 °C)",
      "properties": {}
    },
    {
      "id": "e27",
      "type": "instrument",
      "name": "liquid nitrogen tank (≈‑180 °C)",
      "properties": {}
    },
    {
      "id": "e28",
      "type": "instrument",
      "name": "Thermo Scientific Multidrop Combi dispenser",
      "properties": {}
    },
    {
      "id": "e29",
      "type": "instrument",
      "name": "Tecan D300e digital dispenser",
      "properties": {}
    },
    {
      "id": "e30",
      "type": "instrument",
      "name": "Tecan Spark multimode plate reader",
      "properties": {}
    },
    {
      "id": "e31",
      "type": "reagent",
      "name": "CellTiter‑Glo 3D reagent",
      "properties": {}
    },
    {
      "id": "e32",
      "type": "instrument",
      "name": "plate shaker adapted for 384‑well plates",
      "properties": {}
    },
    {
      "id": "e33",
      "type": "instrument",
      "name": "gamma irradiator",
      "properties": {}
    },
    {
      "id": "e34",
      "type": "reagent",
      "name": "Paraﬁlm",
      "properties": {}
    },
    {
      "id": "e35",
      "type": "reagent",
      "name": "Breathe‑Easy sealing membrane",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e4"
      ],
      "params": {},
      "notes": "Prepare 50‑ml conical tubes."
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e1",
        "e2"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "volume": "45 ml",
        "temperature": "4 °C"
      },
      "notes": "Collect primary tissue pieces in ice‑cold adDMEM/F12+++."
    },
    {
      "id": "s3",
      "op": "manipulate",
      "inputs": [
        "e4",
        "e3"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "add": "10 µM ROCK inhibitor"
      },
      "notes": "Optional addition to increase cell survival; keep at 4 °C."
    },
    {
      "id": "s4",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: tissue may be stored up to 72 h at 4 °C, but proceed ASAP."
    },
    {
      "id": "s5",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e9"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "remove non‑epithelial components"
      },
      "notes": "Use surgical scissors, scalpels, forceps under microscope."
    },
    {
      "id": "s6",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "size": "1–3 mm³"
      },
      "notes": "Mince tissue in a 10‑cm cell culture dish."
    },
    {
      "id": "s7",
      "op": "transfer",
      "inputs": [
        "e1",
        "e6"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "volume": "as needed"
      },
      "notes": "Fix one or two representative fragments in 10 % formalin."
    },
    {
      "id": "s8",
      "op": "transfer",
      "inputs": [
        "e1",
        "e7"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "volume": "as needed"
      },
      "notes": "Alternatively fix in 4 % paraformaldehyde."
    },
    {
      "id": "s9",
      "op": "transfer",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "temperature": "-80 °C"
      },
      "notes": "Snap‑freeze fragments for molecular/biochemical analysis."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e2"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "digest",
        "duration": "<2 h or overnight"
      },
      "notes": "Digest according to Table 1; mix every 10–15 min (shaker for overnight). Optional 10 µM ROCK inhibitor."
    },
    {
      "id": "s11",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e10"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "pipette_cycles": "10–20"
      },
      "notes": "When cloudy, pipette up/down with P1000."
    },
    {
      "id": "s12",
      "op": "transfer",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "volume": "10 ml"
      },
      "notes": "Wash once by topping up with adDMEM/F12+++."
    },
    {
      "id": "s13",
      "op": "centrifuge",
      "inputs": [
        "e4"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "speed": "200 g",
        "time": "5 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s14",
      "op": "resuspend",
      "inputs": [
        "e4",
        "e2"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "volume": "10 ml"
      },
      "notes": ""
    },
    {
      "id": "s15",
      "op": "filter",
      "inputs": [
        "e4",
        "e13"
      ],
      "outputs": [
        "e4"
      ],
      "params": {},
      "notes": "Filter through 100‑µm cell strainer."
    },
    {
      "id": "s16",
      "op": "centrifuge",
      "inputs": [
        "e4"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "speed": "200 g",
        "time": "5 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s17",
      "op": "aspirate",
      "inputs": [
        "e4"
      ],
      "outputs": [],
      "params": {},
      "notes": "Remove supernatant."
    },
    {
      "id": "s18",
      "op": "resuspend",
      "inputs": [
        "e4",
        "e15"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "volume": "≈40 µl per 10 000 cells"
      },
      "notes": "Keep BME on ice; ensure >70 % (vol/vol)."
    },
    {
      "id": "s19",
      "op": "plate",
      "inputs": [
        "e4",
        "e16"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "drop_volume": "~10 µl",
        "drops_per_well": "3–4"
      },
      "notes": "Pre‑heat 24‑well plate overnight at 37 °C, humidified."
    },
    {
      "id": "s20",
      "op": "incubate",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "temperature": "37 °C",
        "CO2": "5 % vol/vol",
        "time": "20–30 min"
      },
      "notes": "Allow BME to solidify."
    },
    {
      "id": "s21",
      "op": "prepare",
      "inputs": [
        "e18",
        "e3",
        "e19"
      ],
      "outputs": [
        "e18"
      ],
      "params": {
        "temperature": "37 °C water bath"
      },
      "notes": "Add 10 µM ROCK inhibitor and Primocin (100 µg ml⁻¹). For head/neck organoids add caspofungin."
    },
    {
      "id": "s22",
      "op": "transfer",
      "inputs": [
        "e18"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "volume": "500 µl per well"
      },
      "notes": "After BME solidified (30–60 min), flip plate and add medium carefully, avoiding direct contact with BME drops."
    },
    {
      "id": "s23",
      "op": "incubate",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "temperature": "37 °C",
        "CO2": "5 % vol/vol"
      },
      "notes": ""
    },
    {
      "id": "s24",
      "op": "manipulate",
      "inputs": [
        "e16"
      ],
      "outputs": [],
      "params": {
        "frequency": "every 2–3 days"
      },
      "notes": "Change medium, keep ROCK inhibitor and Primocin (and caspofungin for head/neck) for first two passages."
    },
    {
      "id": "s25",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "BME drops may detach; re‑plate without TrypLE if needed. First passage typically 12–14 days after plating."
    },
    {
      "id": "s26",
      "op": "manipulate",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "action": "disrupt BME"
      },
      "notes": "Pipette up/down to disrupt BME, transfer organoid suspension to 15‑ml conical tube."
    },
    {
      "id": "s27",
      "op": "transfer",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "volume": "10 ml"
      },
      "notes": "Top up with ice‑cold adDMEM/F12+++."
    },
    {
      "id": "s28",
      "op": "centrifuge",
      "inputs": [
        "e21"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "speed": "200 g",
        "time": "5 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s29",
      "op": "aspirate",
      "inputs": [
        "e21"
      ],
      "outputs": [],
      "params": {},
      "notes": "Remove supernatant."
    },
    {
      "id": "s30",
      "op": "manipulate",
      "inputs": [
        "e21",
        "e22"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "method": "TrypLE"
      },
      "notes": "Resuspend pellet in 1 ml TrypLE, pipette, incubate at 37 °C until organoids fall apart. Pipette ≥10 times every 3–5 min. Do not exceed 15 min total."
    },
    {
      "id": "s31",
      "op": "manipulate",
      "inputs": [
        "e21"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "method": "mechanical"
      },
      "notes": "For organoids not using TrypLE, resuspend pellet in 3 ml adDMEM/F12+++, pipette up/down 30 times with P1000 filter tip."
    },
    {
      "id": "s32",
      "op": "wash",
      "inputs": [
        "e21",
        "e2"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "volume": "10 ml"
      },
      "notes": ""
    },
    {
      "id": "s33",
      "op": "resuspend",
      "inputs": [
        "e21",
        "e15"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "concentration": "70 % vol/vol BME"
      },
      "notes": "Plate as in steps 10–13, invert, incubate 30–60 min."
    },
    {
      "id": "s34",
      "op": "pre‑warm",
      "inputs": [
        "e18",
        "e3"
      ],
      "outputs": [
        "e18"
      ],
      "params": {
        "temperature": "37 °C"
      },
      "notes": ""
    },
    {
      "id": "s35",
      "op": "transfer",
      "inputs": [
        "e18"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "volume": "as in step 14"
      },
      "notes": "Add pre‑warmed medium after BME solidifies; avoid direct contact with drops."
    },
    {
      "id": "s36",
      "op": "incubate",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "temperature": "37 °C",
        "CO2": "5 % vol/vol"
      },
      "notes": "Hold until needed for drug screen."
    },
    {
      "id": "s37",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Optional freezing steps 26–35 (see protocol)."
    },
    {
      "id": "s38",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Optional thawing steps 36–42 (see protocol)."
    },
    {
      "id": "s39",
      "op": "manipulate",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "action": "add 1 mg ml⁻¹ dispase II"
      },
      "notes": "Disrupt BME droplets; incubate 40 min at 37 °C."
    },
    {
      "id": "s40",
      "op": "collect",
      "inputs": [
        "e4"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "volume": "as collected"
      },
      "notes": "Pipette up/down 10 times, top up with 10 ml adDMEM/F12+++ per 2 ml suspension, resuspend, centrifuge."
    },
    {
      "id": "s41",
      "op": "centrifuge",
      "inputs": [
        "e21"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "speed": "200 g",
        "time": "5 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s42",
      "op": "resuspend",
      "inputs": [
        "e21",
        "e2"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "volume": "10 ml"
      },
      "notes": ""
    },
    {
      "id": "s43",
      "op": "filter",
      "inputs": [
        "e21",
        "e14"
      ],
      "outputs": [
        "e21"
      ],
      "params": {},
      "notes": "70‑µm cell strainer."
    },
    {
      "id": "s44",
      "op": "centrifuge",
      "inputs": [
        "e21"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "speed": "200 g",
        "time": "5 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s45",
      "op": "count",
      "inputs": [
        "e21"
      ],
      "outputs": [],
      "params": {
        "method": "disposable counting chamber"
      },
      "notes": "Resuspend pellet in 1–10 ml adDMEM/F12+++, take 10 µl for counting, then scale up."
    },
    {
      "id": "s46",
      "op": "resuspend",
      "inputs": [
        "e21",
        "e18"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "BME_fraction": "5 % vol/vol"
      },
      "notes": "Use P200 pipette for initial resuspension, then top up with remaining medium+BME."
    },
    {
      "id": "s47",
      "op": "run_device",
      "inputs": [
        "e21",
        "e28"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "device": "Multidrop Combi dispenser"
      },
      "notes": "Wash tubing: MilliQ water → 70 % ethanol → PBS → PBS (clean tube). Flush at least twice tube volume each wash; keep tubing wet."
    },
    {
      "id": "s48",
      "op": "run_device",
      "inputs": [
        "e28"
      ],
      "outputs": [],
      "params": {
        "action": "prime tubing"
      },
      "notes": "Flush once with ice‑cold adDMEM/F12+++ before organoid loading."
    },
    {
      "id": "s49",
      "op": "manipulate",
      "inputs": [
        "e21"
      ],
      "outputs": [
        "e21"
      ],
      "params": {
        "action": "invert tube for homogenous suspension"
      },
      "notes": ""
    },
    {
      "id": "s50",
      "op": "run_device",
      "inputs": [
        "e21",
        "e28"
      ],
      "outputs": [
        "e30"
      ],
      "params": {
        "plate_type": "384‑well ultra‑low attachment",
        "volume_per_well": "40 µl"
      },
      "notes": "Dispense organoid solution quickly after priming."
    },
    {
      "id": "s51",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Optional GR‑metric viability assay (step 55) can be performed on a separate plate."
    },
    {
      "id": "s52",
      "op": "observe",
      "inputs": [
        "e30"
      ],
      "outputs": [],
      "params": {
        "method": "bright‑field microscopy"
      },
      "notes": "Confirm homogeneous distribution of organoids."
    },
    {
      "id": "s53",
      "op": "run_device",
      "inputs": [
        "e30"
      ],
      "outputs": [],
      "params": {
        "action": "clean dispenser"
      },
      "notes": "Wash with MilliQ water → 1 % Micro‑90 → 10 % chloride solution → MilliQ water (twice). Use separate 50‑ml tubes for final washes."
    },
    {
      "id": "s54",
      "op": "run_device",
      "inputs": [
        "e29"
      ],
      "outputs": [],
      "params": {
        "device": "Tecan D300e digital dispenser"
      },
      "notes": "Open new 384‑well plate layout, set additional volume 40 µl."
    },
    {
      "id": "s55",
      "op": "manipulate",
      "inputs": [
        "e29"
      ],
      "outputs": [],
      "params": {
        "action": "add compounds"
      },
      "notes": "Add drugs with stock ≤10 mM; ensure final 0.3 % Tween‑20 for PBS/water stocks."
    },
    {
      "id": "s56",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Do not use outer edges of plate; include positive (1–10 µM staurosporin) and appropriate negative controls."
    },
    {
      "id": "s57",
      "op": "run_device",
      "inputs": [
        "e29"
      ],
      "outputs": [],
      "params": {
        "action": "run program"
      },
      "notes": "Dispense drugs; then incubate plate 37 °C, 5 % CO₂."
    },
    {
      "id": "s58",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Optional irradiation (steps 69–74)."
    },
    {
      "id": "s59",
      "op": "run_device",
      "inputs": [
        "e33"
      ],
      "outputs": [],
      "params": {
        "dose": "2 Gy"
      },
      "notes": "Set radiation machine, cover plate edges with Paraﬁlm (or Breathe‑Easy membrane). Place plate in water‑filled box, irradiate."
    },
    {
      "id": "s60",
      "op": "manipulate",
      "inputs": [
        "e30"
      ],
      "outputs": [],
      "params": {
        "action": "dry plate"
      },
      "notes": "Remove Paraﬁlm, dry with paper tissue."
    },
    {
      "id": "s61",
      "op": "run_device",
      "inputs": [
        "e31"
      ],
      "outputs": [],
      "params": {
        "device": "Tecan Spark"
      },
      "notes": "Thaw CellTiter‑Glo 3D reagent at 37 °C water bath for 15 min."
    },
    {
      "id": "s62",
      "op": "run_device",
      "inputs": [
        "e30",
        "e31"
      ],
      "outputs": [],
      "params": {
        "volume": "40 µl per well"
      },
      "notes": "Dispense reagent using same dispenser as organoid loading."
    },
    {
      "id": "s63",
      "op": "run_device",
      "inputs": [
        "e30"
      ],
      "outputs": [],
      "params": {
        "device": "plate shaker",
        "time": "5 min"
      },
      "notes": "Shake plate (shaker adapted for 384‑well format)."
    },
    {
      "id": "s64",
      "op": "incubate",
      "inputs": [
        "e30"
      ],
      "outputs": [],
      "params": {
        "temperature": "room temperature",
        "time": "15 min"
      },
      "notes": ""
    },
    {
      "id": "s65",
      "op": "measure",
      "inputs": [
        "e30",
        "e30"
      ],
      "outputs": [
        "e30"
      ],
      "params": {
        "device": "Tecan Spark",
        "mode": "luminescence",
        "integration_time": "500 ms per well"
      },
      "notes": "Read luminescence; longer integration if signal low."
    },
    {
      "id": "s66",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Data analysis (steps 80–89) performed in Microsoft Excel and GraphPad Prism; calculations of Z‑factor, viability, IC₅₀/AUC, etc."
    }
  ]
}