{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "10.1038/s41596-020-0379-4",
    "title": "Establishment of patient-derived cancer organoids for drug-screening applications",
    "source": "Nature Protocols",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "unknown",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": true,
    "contamination_control": [
      "use sterile technique"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "Primary tissue (normal or tumor)",
      "properties": {
        "origin": "patient",
        "status": "fresh"
      }
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "Trypsin 0.125% (wt/vol)",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "Basement Membrane Extract (BME)",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "Organoid culture medium (growth factor cocktail)",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "consumable",
      "name": "100 µm cell strainer",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "container",
      "name": "15 mL conical tube (sterile)",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "container",
      "name": "Pre‑warmed 384‑well plate",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "instrument",
      "name": "Incubator (37 °C, 5 % CO₂)",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "instrument",
      "name": "Centrifuge",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "instrument",
      "name": "Pipette (manual)",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e1"
      ],
      "params": {},
      "notes": "Obtain fresh primary tissue from patient (normal or tumor)."
    },
    {
      "id": "s2",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {},
      "notes": "Dissect to remove excess muscle or fat tissue, retaining epithelial tissue."
    },
    {
      "id": "s3",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "fragment_size": "1–3 mm³"
      },
      "notes": "Mince tissue into small fragments using a scalpel."
    },
    {
      "id": "s4",
      "op": "transfer",
      "inputs": [
        "e1",
        "e2",
        "e6"
      ],
      "outputs": [
        "e6"
      ],
      "params": {
        "reagent_volume": "sufficient to cover tissue"
      },
      "notes": "Add trypsin 0.125 % (wt/vol) to the minced tissue in a sterile tube."
    },
    {
      "id": "s5",
      "op": "incubate",
      "inputs": [
        "e6"
      ],
      "outputs": [
        "e6"
      ],
      "params": {
        "temperature": "37 °C",
        "max_time": "60 min",
        "resuspend_interval": "10 min"
      },
      "notes": "Digest tissue, monitoring closely; resuspend the suspension every 10 min. Do not exceed 60 min."
    },
    {
      "id": "s6",
      "op": "manipulate",
      "inputs": [
        "e6",
        "e5"
      ],
      "outputs": [
        "e6"
      ],
      "params": {},
      "notes": "Filter the digestion suspension through a 100 µm‑pore cell strainer to remove debris."
    },
    {
      "id": "s7",
      "op": "centrifuge",
      "inputs": [
        "e6"
      ],
      "outputs": [
        "e6"
      ],
      "params": {
        "purpose": "pellet cells",
        "note": "Centrifuge to increase yield (speed and time not specified)."
      },
      "notes": "Pellet cells by centrifugation."
    },
    {
      "id": "s8",
      "op": "manipulate",
      "inputs": [
        "e6"
      ],
      "outputs": [
        "e6"
      ],
      "params": {},
      "notes": "Remove supernatant, keep the cell pellet on ice (cold)."
    },
    {
      "id": "s9",
      "op": "transfer",
      "inputs": [
        "e6",
        "e3"
      ],
      "outputs": [
        "e6"
      ],
      "params": {
        "reagent_volume": "sufficient to resuspend pellet"
      },
      "notes": "Resuspend the cell pellet in basement membrane extract (BME)."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "e6",
        "e7"
      ],
      "outputs": [
        "e7"
      ],
      "params": {},
      "notes": "Plate the BME‑cell mixture onto a pre‑warmed 384‑well plate; invert the plate to allow the BME to solidify."
    },
    {
      "id": "s11",
      "op": "incubate",
      "inputs": [
        "e7"
      ],
      "outputs": [
        "e7"
      ],
      "params": {
        "temperature": "37 °C",
        "CO2": "5 %",
        "duration": "until organoids form (typically 7–12 days)"
      },
      "notes": "Culture organoids in the incubator with appropriate organoid culture medium."
    },
    {
      "id": "s12",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Further steps such as drug screening, passage, cryopreservation, and detailed medium composition are described in the paper but not specified in sufficient detail for automated translation."
    }
  ]
}