{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-020-0379-4",
    "title": "Protocol",
    "source": "s41596-020-0379-4.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "unknown",
    "contains_human_or_animal_material": false,
    "requires_irb_or_iacuc": false,
    "sterility_required": false,
    "contamination_control": []
  },
  "entities": [
    {
      "id": "e1",
      "type": "container",
      "name": "384-well plate",
      "properties": {
        "format": "384-well",
        "well_volume_ul": 40
      }
    },
    {
      "id": "e2",
      "type": "instrument",
      "name": "Pipette",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "sample",
      "name": "Cell suspension (generic)",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "Drug mixture (generic)",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e1"
      ],
      "params": {
        "container_type": "384-well plate"
      },
      "notes": "Allocate a 384‑well plate for the assay."
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e3"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume_ul": 40,
        "destination": "well"
      },
      "notes": "Seed cells into each well. The number of cells per well varies by organ and condition as listed in the table (e.g., Endometrium 10–2,000 cells on the day of plating, Liver 2–6,000 cells, etc.)."
    },
    {
      "id": "s3",
      "op": "transfer",
      "inputs": [
        "e4"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume_ul": 40,
        "destination": "well"
      },
      "notes": "Add drug(s) to each well. The specific drug(s) and number of drugs per condition are given in the table (e.g., Paclitaxel, 5‑FU, carboplatin, etc.)."
    },
    {
      "id": "s4",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Incubate plates under standard cell‑culture conditions (37 °C, 5 % CO₂) for the duration indicated in the original study (not explicitly provided in the table)."
    },
    {
      "id": "s5",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Perform readout/measurement as described in the original protocol (e.g., viability assay, imaging). Specific assay details are not provided in the extracted text."
    },
    {
      "id": "s6",
      "op": "dispose",
      "inputs": [
        "e1"
      ],
      "outputs": [],
      "params": {},
      "notes": "Dispose of the plate and all consumables according to institutional biohazard waste procedures."
    }
  ]
}