{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-023-00814-x",
    "title": "Procedure",
    "source": "s41596-023-00814-x.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "",
    "contains_human_or_animal_material": false,
    "requires_irb_or_iacuc": false,
    "sterility_required": false,
    "contamination_control": []
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "60-d-old OVB organoid",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "container",
      "name": "12-well suspension culture plate",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "OVB-organoid medium",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "container",
      "name": "50 ml centrifuge tube",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "consumable",
      "name": "10 ml sterile serological pipette",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "instrument",
      "name": "clean bench",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "instrument",
      "name": "red light source",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "consumable",
      "name": "opaque box (optional)",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "instrument",
      "name": "ERG aperture",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "instrument",
      "name": "superfusion system",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "instrument",
      "name": "electrode chamber",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "instrument",
      "name": "light flash source",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "instrument",
      "name": "150 W white light bulb",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "consumable",
      "name": "infrared filter",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "reagent",
      "name": "10 mM aspartate in OVB medium",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "waste",
      "name": "experimental waste",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "transfer",
      "inputs": [
        "e1",
        "e3",
        "e2"
      ],
      "outputs": [],
      "params": {
        "volume_per_well_ml": 2,
        "destination": "well of 12‑well plate"
      },
      "notes": "Transfer one 60‑d‑old organoid to each well and add 2 ml OVB‑organoid medium."
    },
    {
      "id": "s2",
      "op": "incubate",
      "inputs": [
        "e2"
      ],
      "outputs": [],
      "params": {
        "temperature_C": 37,
        "CO2_percent": 5,
        "duration_h": 24,
        "light_condition": "absolute darkness"
      },
      "notes": ""
    },
    {
      "id": "s3",
      "op": "manipulate",
      "inputs": [
        "e3",
        "e4",
        "e5",
        "e6"
      ],
      "outputs": [],
      "params": {
        "tube_volume_ml": 50,
        "oxygenation_method": "pump air onto bottom of tube with sterile 10 ml serological pipette",
        "oxygenation_duration_min": 2,
        "environment": "clean bench"
      },
      "notes": ""
    },
    {
      "id": "s4",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Handle OVB organoids and perform ERG experiment in an absolutely dark room using a red light (e.g., from the western blot developing room) as the sole light source. Use an opaque box if needed for transport."
    },
    {
      "id": "s5",
      "op": "manipulate",
      "inputs": [
        "e9",
        "e10",
        "e3"
      ],
      "outputs": [],
      "params": {
        "action": "fill superfusion system with oxygenated OVB medium"
      },
      "notes": ""
    },
    {
      "id": "s6",
      "op": "transfer",
      "inputs": [
        "e1",
        "e11",
        "e7"
      ],
      "outputs": [],
      "params": {
        "light_condition": "red light"
      },
      "notes": "Place organoids under red light in the electrode chamber."
    },
    {
      "id": "s7",
      "op": "manipulate",
      "inputs": [
        "e11",
        "e9",
        "e10"
      ],
      "outputs": [],
      "params": {
        "action": "place electrode chamber into dark chamber of ERG aperture and connect to superfusion system"
      },
      "notes": ""
    },
    {
      "id": "s8",
      "op": "run_device",
      "inputs": [
        "e10"
      ],
      "outputs": [],
      "params": {
        "speed_ml_per_min": 0.5
      },
      "notes": "Set superfusion speed to 0.5 ml/min."
    },
    {
      "id": "s9",
      "op": "measure",
      "inputs": [
        "e12",
        "e1"
      ],
      "outputs": [],
      "params": {
        "flash_duration_ms": 500,
        "intensities_mlux": [
          2000,
          20000,
          200000
        ],
        "repeats_per_intensity": 3,
        "interval_min": 3,
        "record": "electrical responses"
      },
      "notes": "Dose‑dependent light sensitivity assay."
    },
    {
      "id": "s10",
      "op": "measure",
      "inputs": [
        "e12",
        "e1"
      ],
      "outputs": [],
      "params": {
        "flash_duration_ms": 500,
        "intensity_mlux": 200000,
        "interval_min": 3,
        "total_duration_min": 15,
        "record": "electrical responses",
        "note": "Continue with same organoids or start with new organoids."
      },
      "notes": "Photic stress experiment (pre‑bright light)."
    },
    {
      "id": "s11",
      "op": "run_device",
      "inputs": [
        "e13",
        "e1"
      ],
      "outputs": [],
      "params": {
        "intensity_lux": 4600,
        "duration_min": 10
      },
      "notes": "Desensitize organoid with bright light exposure."
    },
    {
      "id": "s12",
      "op": "manipulate",
      "inputs": [
        "e14",
        "e13",
        "e11"
      ],
      "outputs": [],
      "params": {
        "action": "place infrared filter between bulb and electrode chamber"
      },
      "notes": ""
    },
    {
      "id": "s13",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [],
      "params": {
        "duration_s": 30,
        "light_condition": "darkness"
      },
      "notes": "Regeneration period after bright light."
    },
    {
      "id": "s14",
      "op": "measure",
      "inputs": [
        "e12",
        "e1"
      ],
      "outputs": [],
      "params": {
        "flash_duration_ms": 500,
        "intensity_mlux": 200000,
        "interval_min": 3,
        "record": "electrical responses"
      },
      "notes": ""
    },
    {
      "id": "s15",
      "op": "run_device",
      "inputs": [
        "e13",
        "e1"
      ],
      "outputs": [],
      "params": {
        "intensity_lux": 0,
        "duration_min": 0,
        "note": "Negative control: repeat bright‑light step with 0 mlux (darkness)."
      },
      "notes": ""
    },
    {
      "id": "s16",
      "op": "run_device",
      "inputs": [
        "e10"
      ],
      "outputs": [],
      "params": {
        "speed_ml_per_min": 2
      },
      "notes": "Increase superfusion speed for A‑wave isolation."
    },
    {
      "id": "s17",
      "op": "incubate",
      "inputs": [
        "e1",
        "e10"
      ],
      "outputs": [],
      "params": {
        "duration_min": 36,
        "stability_criterion": "stable electrical signal of –200 mV to 200 000 mlux 500 ms flashes",
        "record_interval_min": 3,
        "record": "continuous electric response"
      },
      "notes": ""
    },
    {
      "id": "s18",
      "op": "manipulate",
      "inputs": [
        "e15",
        "e10"
      ],
      "outputs": [],
      "params": {
        "action": "add 10 mM aspartate to medium after equilibration"
      },
      "notes": "Aspartate blocks signal transduction (A‑wave)."
    },
    {
      "id": "s19",
      "op": "manipulate",
      "inputs": [
        "e3",
        "e10"
      ],
      "outputs": [],
      "params": {
        "action": "wash out aspartate by adding OVB organoid medium without aspartate"
      },
      "notes": "Continue recording electric signals."
    }
  ]
}