{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-023-00814-x",
    "title": "Procedure",
    "source": "Paper s41596-023-00814-x.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": false,
    "sterility_required": true,
    "contamination_control": [
      "use sterile technique"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "OVB organoids",
      "properties": {
        "day": "30 or 60"
      }
    },
    {
      "id": "e2",
      "type": "container",
      "name": "15 ml sterile centrifuge tube",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "consumable",
      "name": "1,000 µl cut micropipette tip",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "consumable",
      "name": "200 µl micropipette tip",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "PBS",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "Accutase",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "DNase I",
      "properties": {
        "concentration": "0.2 U/µl"
      }
    },
    {
      "id": "e8",
      "type": "instrument",
      "name": "Water bath",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "Rock inhibitor",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "consumable",
      "name": "70 µm sterile cell strainer",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "instrument",
      "name": "Centrifuge",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "reagent",
      "name": "DMEM/F12",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "reagent",
      "name": "OVB organoid medium",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "reagent",
      "name": "Trypan‑blue",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "reagent",
      "name": "Chromium Single Cell 3′ Reagent Kit v3",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "reagent",
      "name": "Primer mixture",
      "properties": {
        "components": "Illumina R1 sequence, 16 bp 10× barcode, 12 bp UMI, poly‑dT primer"
      }
    },
    {
      "id": "e17",
      "type": "consumable",
      "name": "Gel beads‑in‑emulsion (GEM) chips",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "reagent",
      "name": "Silane magnetic beads",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "instrument",
      "name": "PCR thermocycler",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "description": "Collect up to three OVB organoids (day 30 or day 60) into a sterile 15 ml centrifuge tube using a cut 1,000 µl micropipette tip."
      },
      "notes": ""
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e2",
        "e4"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "volume": "carried‑over medium (unspecified)",
        "method": "remove medium carefully with a 200 µl micropipette tip without disturbing organoids"
      },
      "notes": ""
    },
    {
      "id": "s3",
      "op": "annotate",
      "inputs": [
        "e2",
        "e5"
      ],
      "outputs": [
        "e2"
      ],
      "params": {},
      "notes": "Wash organoids three times with 3 ml PBS and withdraw the PBS after each wash."
    },
    {
      "id": "s4",
      "op": "transfer",
      "inputs": [
        "e2",
        "e6",
        "e7"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "volume": "2 ml",
        "description": "Add 2 ml Accutase containing 0.2 U/µl DNase I (pre‑warmed in a 37 °C water bath). Close tube tightly."
      },
      "notes": ""
    },
    {
      "id": "s5",
      "op": "incubate",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "temperature": "37 °C",
        "duration": "15 min",
        "device": "e8"
      },
      "notes": "After 15 min, check dissociation by shaking the tube and observing organoid integrity. Then dissociate by pipetting up and down with an uncut 1,000 µl micropipette tip."
    },
    {
      "id": "s6",
      "op": "incubate",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "temperature": "37 °C",
        "duration": "15 min",
        "device": "e8"
      },
      "notes": ""
    },
    {
      "id": "s7",
      "op": "annotate",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {},
      "notes": "Repeat step 5 (check and pipette dissociation)."
    },
    {
      "id": "s8",
      "op": "incubate",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "temperature": "37 °C",
        "duration": "15 min",
        "device": "e8"
      },
      "notes": "Do not exceed 45 min total Accutase treatment."
    },
    {
      "id": "s9",
      "op": "transfer",
      "inputs": [
        "e2",
        "e12"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "volume": "8 ml",
        "description": "Stop Accutase treatment by adding 8 ml DMEM/F12 pre‑warmed in a 37 °C water bath."
      },
      "notes": ""
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "e2",
        "e10"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "description": "Filter the suspension through a sterile 70 µm cell strainer to obtain a single‑cell suspension."
      },
      "notes": ""
    },
    {
      "id": "s11",
      "op": "run_device",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "device": "e11",
        "speed": "500 g",
        "duration": "5 min",
        "temperature": "room temperature"
      },
      "notes": ""
    },
    {
      "id": "s12",
      "op": "manipulate",
      "inputs": [
        "e2",
        "e13",
        "e14"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "description": "Aspirate supernatant, resuspend cell pellet in 1 ml OVB organoid medium, perform Trypan‑blue staining and count cells."
      },
      "notes": "Recommended viability: 65–95 % to continue."
    },
    {
      "id": "s13",
      "op": "annotate",
      "inputs": [
        "e2",
        "e15"
      ],
      "outputs": [
        "e2"
      ],
      "params": {},
      "notes": "For scRNA‑seq library construction, use Chromium Single Cell 3′ Reagent Kit v3 (manufacturer's instructions) targeting 2,000–3,000 cells per sample."
    },
    {
      "id": "s14",
      "op": "annotate",
      "inputs": [],
      "outputs": [
        "e16"
      ],
      "params": {},
      "notes": "Make a primer mixture using primers containing an Illumina R1 sequence, a 16 bp 10× barcode, a 12 bp unique molecular identifier, and a poly‑dT primer."
    },
    {
      "id": "s15",
      "op": "annotate",
      "inputs": [
        "e16",
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {},
      "notes": "Mix primer mixture with cell lysate and master mix."
    },
    {
      "id": "s16",
      "op": "annotate",
      "inputs": [
        "e2",
        "e17"
      ],
      "outputs": [
        "e2"
      ],
      "params": {},
      "notes": "Incubate gel beads‑in‑emulsion (GEM) chips to produce barcoded full‑length cDNA from poly‑adenylated mRNA, then break the chips and recover pooled cDNAs."
    },
    {
      "id": "s17",
      "op": "annotate",
      "inputs": [
        "e2",
        "e18"
      ],
      "outputs": [
        "e2"
      ],
      "params": {},
      "notes": "Clean up cDNA using silane magnetic beads to remove leftover biochemistry and primers."
    },
    {
      "id": "s18",
      "op": "annotate",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {},
      "notes": "Amplify full‑length barcoded cDNA by PCR for library construction (see supporting work for details)."
    }
  ]
}