{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-023-00814-x",
    "title": "Procedure",
    "source": "s41596-023-00814-x.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "",
    "contains_human_or_animal_material": false,
    "requires_irb_or_iacuc": false,
    "sterility_required": true,
    "contamination_control": [
      "clean bench"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "instrument",
      "name": "micromanipulator",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "70% ethanol (eEtOH)",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "instrument",
      "name": "DMZ Universal Electrode Puller",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "consumable",
      "name": "fine glass capillary pipette",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "CTB-488",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "CTB-647",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "DMEM/F12",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "container",
      "name": "sterile 1.5 ml microtube",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "Matrigel",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "container",
      "name": "sterile glass slide",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "sample",
      "name": "OVB organoid (day 60)",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "consumable",
      "name": "cut 1,000 µl micropipette tip",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "consumable",
      "name": "200 µl micropipette tip",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "instrument",
      "name": "stereomicroscope",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "instrument",
      "name": "microinjector",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "container",
      "name": "24‑well plate",
      "properties": {}
    },
    {
      "id": "e17",
      "type": "container",
      "name": "sterile 1 ml tube",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "reagent",
      "name": "4 % PFA (prewarmed)",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "instrument",
      "name": "37 °C water bath",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "reagent",
      "name": "30 % EtOH (vol/vol)",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "reagent",
      "name": "50 % EtOH (vol/vol)",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "reagent",
      "name": "75 % EtOH (vol/vol)",
      "properties": {}
    },
    {
      "id": "e23",
      "type": "reagent",
      "name": "100 % EtOH (vol/vol)",
      "properties": {}
    },
    {
      "id": "e24",
      "type": "reagent",
      "name": "ethyl cinnamate (ECI)",
      "properties": {}
    },
    {
      "id": "e25",
      "type": "container",
      "name": "coverslip‑bottom µ‑slide",
      "properties": {}
    },
    {
      "id": "e26",
      "type": "instrument",
      "name": "Zeiss LSM 880 confocal microscope",
      "properties": {}
    },
    {
      "id": "e27",
      "type": "software",
      "name": "Imaris x64 v7.7.1",
      "properties": {}
    },
    {
      "id": "e28",
      "type": "software",
      "name": "ImageJ",
      "properties": {}
    },
    {
      "id": "e29",
      "type": "software",
      "name": "Adobe Photoshop CC 2017",
      "properties": {}
    },
    {
      "id": "e30",
      "type": "software",
      "name": "Adobe Illustrator CC 2017",
      "properties": {}
    },
    {
      "id": "e31",
      "type": "reagent",
      "name": "OVB medium",
      "properties": {}
    },
    {
      "id": "e32",
      "type": "reagent",
      "name": "DAPI (405 nm)",
      "properties": {}
    },
    {
      "id": "e33",
      "type": "reagent",
      "name": "Immunofluorescence reagents (594 nm)",
      "properties": {}
    },
    {
      "id": "e34",
      "type": "reagent",
      "name": "CTB-488 dilution (1:1 vol/vol in DMEM/F12, protected from light)",
      "properties": {}
    },
    {
      "id": "e35",
      "type": "reagent",
      "name": "CTB-647 dilution (1:1 vol/vol in DMEM/F12, protected from light)",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Perform all steps under a clean bench."
    },
    {
      "id": "s2",
      "op": "manipulate",
      "inputs": [
        "e2",
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "clean",
        "solution": "70% ethanol"
      },
      "notes": "Clean the micromanipulator with 70% ethanol and place it under the clean bench."
    },
    {
      "id": "s3",
      "op": "manipulate",
      "inputs": [
        "e3"
      ],
      "outputs": [
        "e4"
      ],
      "params": {
        "action": "pull",
        "product": "fine glass capillary pipette"
      },
      "notes": "Prepare fine glass capillary pipettes using the DMZ Universal Electrode Puller."
    },
    {
      "id": "s4",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Check if the capillary opening is still accessible by sucking and releasing DMEM/F12."
    },
    {
      "id": "s5",
      "op": "manipulate",
      "inputs": [
        "e5",
        "e7",
        "e8"
      ],
      "outputs": [
        "e34"
      ],
      "params": {
        "ratio": "1:1 vol/vol",
        "container": "sterile 1.5 ml microtube",
        "light_protection": true
      },
      "notes": "Prepare 1:1 (vol/vol) dilution of CTB-488 in DMEM/F12."
    },
    {
      "id": "s5b",
      "op": "manipulate",
      "inputs": [
        "e6",
        "e7",
        "e8"
      ],
      "outputs": [
        "e35"
      ],
      "params": {
        "ratio": "1:1 vol/vol",
        "container": "sterile 1.5 ml microtube",
        "light_protection": true
      },
      "notes": "Prepare 1:1 (vol/vol) dilution of CTB-647 in DMEM/F12."
    },
    {
      "id": "s6",
      "op": "manipulate",
      "inputs": [
        "e9",
        "e10"
      ],
      "outputs": [
        "e10"
      ],
      "params": {
        "drop_volume": "10 µl",
        "location": "near edge of slide",
        "solidify": true
      },
      "notes": "Place a 10 µl drop of Matrigel near an edge of a sterile glass slide and let it solidify."
    },
    {
      "id": "s7",
      "op": "transfer",
      "inputs": [
        "e11",
        "e10",
        "e12"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "method": "cut 1,000 µl micropipette tip",
        "destination": "Matrigel drop on slide"
      },
      "notes": "Collect OVB organoids (day 60) and place them on the Matrigel drop."
    },
    {
      "id": "s8",
      "op": "manipulate",
      "inputs": [
        "e11"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "action": "remove excess medium",
        "leave": "thin film or small drop"
      },
      "notes": "Remove excess medium carefully, leaving a thin film to prevent drying."
    },
    {
      "id": "s9",
      "op": "manipulate",
      "inputs": [
        "e10",
        "e14"
      ],
      "outputs": [
        "e10"
      ],
      "params": {
        "action": "place on stage holder of stereomicroscope"
      },
      "notes": "Place glass slide with organoids on the stage holder of a stereomicroscope under the clean bench."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "e15",
        "e11"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "action": "move close to organoids on microscope stage"
      },
      "notes": "Move the microinjector close to the organoids."
    },
    {
      "id": "s11",
      "op": "transfer",
      "inputs": [
        "e34",
        "e4"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "volume": "3 µl",
        "method": "front fill injection",
        "target": "first pigmented area"
      },
      "notes": "Fill glass capillary tip with 3 µl of CTB-488 dilution and inject into the first OV."
    },
    {
      "id": "s12",
      "op": "manipulate",
      "inputs": [
        "e15"
      ],
      "outputs": [
        "e15"
      ],
      "params": {
        "action": "move tip backward and replace with new thin glass tip"
      },
      "notes": "Replace the tip with a new thin glass tip."
    },
    {
      "id": "s13",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Add one drop of OVB medium on the organoid to prevent it from drying out."
    },
    {
      "id": "s14",
      "op": "transfer",
      "inputs": [
        "e35",
        "e4"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "volume": "3 µl",
        "target": "second pigmented area"
      },
      "notes": "Fill glass pipette tip with 3 µl of CTB-647 dilution and repeat injection for the second pigmented area."
    },
    {
      "id": "s15",
      "op": "transfer",
      "inputs": [
        "e11",
        "e16",
        "e12"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "method": "cut 1,000 µl micropipette tip",
        "destination": "well of 24‑well plate"
      },
      "notes": "Transfer the injected organoids into a well of a 24‑well plate for suspension culture."
    },
    {
      "id": "s15b",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Expose the plate to normal room light for 10 min."
    },
    {
      "id": "s16",
      "op": "incubate",
      "inputs": [
        "e16"
      ],
      "outputs": [
        "e16"
      ],
      "params": {
        "temperature": "37 °C",
        "CO2": "5 %",
        "duration": "24 h"
      },
      "notes": "Culture the plate at 37 °C and 5 % CO₂ for 24 h."
    },
    {
      "id": "s17",
      "op": "transfer",
      "inputs": [
        "e11",
        "e17",
        "e12"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "method": "cut 1,000 µl micropipette tip",
        "destination": "sterile 1 ml tube"
      },
      "notes": "Collect CTB‑injected OVB organoids in a sterile 1 ml tube."
    },
    {
      "id": "s18",
      "op": "manipulate",
      "inputs": [
        "e11",
        "e13"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "action": "remove carried‑over medium without disturbing organoids"
      },
      "notes": "Carefully remove any carried‑over medium with a 200 µl micropipette tip."
    },
    {
      "id": "s19",
      "op": "incubate",
      "inputs": [
        "e11",
        "e7"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "duration": "3 min",
        "temperature": "prewarmed",
        "volume": "1 ml",
        "shaking": false
      },
      "notes": "Wash organoids once with 1 ml of prewarmed DMEM/F12 for 3 min and remove the DMEM/F12."
    },
    {
      "id": "s20",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Protect organoids from light in all of the following steps."
    },
    {
      "id": "s21",
      "op": "incubate",
      "inputs": [
        "e11",
        "e18"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "temperature": "RT",
        "duration": "30–60 min",
        "light_protection": true
      },
      "notes": "Add 1 ml of 4 % PFA (prewarmed) and incubate at RT for 30–60 min."
    },
    {
      "id": "s22",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Do not exceed the time of PFA fixation above 1 h because this will lead to high autofluorescence."
    },
    {
      "id": "s23a",
      "op": "incubate",
      "inputs": [
        "e11",
        "e20"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "duration": "30 min",
        "temperature": "4 °C",
        "shaking": true,
        "light_protection": true
      },
      "notes": "Dehydrate in 30 % EtOH (vol/vol) for 30 min at 4 °C, gently shaking, protected from light."
    },
    {
      "id": "s23b",
      "op": "incubate",
      "inputs": [
        "e11",
        "e21"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "duration": "30 min",
        "temperature": "4 °C",
        "shaking": true,
        "light_protection": true
      },
      "notes": "Dehydrate in 50 % EtOH (vol/vol) for 30 min at 4 °C, gently shaking, protected from light."
    },
    {
      "id": "s23c",
      "op": "incubate",
      "inputs": [
        "e11",
        "e22"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "duration": "30 min",
        "temperature": "4 °C",
        "shaking": true,
        "light_protection": true
      },
      "notes": "Dehydrate in 75 % EtOH (vol/vol) for 30 min at 4 °C, gently shaking, protected from light."
    },
    {
      "id": "s23d",
      "op": "incubate",
      "inputs": [
        "e11",
        "e23"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "duration": "30 min",
        "temperature": "4 °C",
        "shaking": true,
        "light_protection": true
      },
      "notes": "Dehydrate in 100 % EtOH (vol/vol) for 30 min at 4 °C, gently shaking, protected from light."
    },
    {
      "id": "s24",
      "op": "incubate",
      "inputs": [
        "e11",
        "e24"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "duration": "30 min",
        "temperature": "RT",
        "light_protection": true
      },
      "notes": "Clear the organoids with ethyl cinnamate (ECI) for 30 min at RT, protected from light."
    },
    {
      "id": "s25",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Without tissue clearing, it is impossible to detect clear signals from the fluorescent‑tagged CTBs inside the organoid."
    },
    {
      "id": "s26",
      "op": "transfer",
      "inputs": [
        "e11",
        "e25",
        "e12"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "method": "cut 1,000 µl micropipette tip",
        "destination": "coverslip‑bottom µ‑slide",
        "medium": "ECI",
        "light_protection": true
      },
      "notes": "Place organoid in ECI with a cut 1,000 µl micropipette tip into coverslip‑bottom µ‑slides protected from light."
    },
    {
      "id": "s27",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Organoids can be stored in the ECI at 4 °C protected from light until 3D imaging. Do not exceed storing for more than 2 weeks."
    },
    {
      "id": "s28",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Perform additional staining using the blue (405 nm) or red (594 nm) channel, e.g., DAPI (405) and/or immunofluorescence (594)."
    },
    {
      "id": "s29",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Store CTB‑injected, tissue‑cleared and stained organoids for no longer than 2 weeks total at 4 °C protected from light."
    },
    {
      "id": "s30",
      "op": "run_device",
      "inputs": [
        "e11",
        "e26"
      ],
      "outputs": [
        "e27"
      ],
      "params": {
        "device": "Zeiss LSM 880 confocal microscope",
        "objectives": [
          "EC Plan‑Neoﬂuor 10×/0.3",
          "Plan‑Apochromat 20×/0.8 M27"
        ],
        "orientation": "pigmented areas facing side of µ‑slide chamber"
      },
      "notes": "Perform 3D imaging of an OVB organoid."
    },
    {
      "id": "s31",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Export raw files to Imaris x64 version 7.7.1 for surface and volume rendering."
    },
    {
      "id": "s32",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Process obtained files further using ImageJ, Adobe Photoshop CC 2017, and Adobe Illustrator CC 2017."
    }
  ]
}