{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-023-00814-x",
    "title": "Procedure",
    "source": "s41596-023-00814-x.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": false,
    "sterility_required": true,
    "contamination_control": []
  },
  "entities": [
    {
      "id": "e1",
      "type": "container",
      "name": "24-well plate",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "container",
      "name": "glass coverslip (12 mm diameter)",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "Matrigel/DMEM/F12 solution",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "mTESR1 medium",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "Rock inhibitor (Y-27632 2HCl)",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "sample",
      "name": "human iPSC suspension",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "DMEM/F12",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "PFA",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "PBS‑Glycine",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "permeabilization solution",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "reagent",
      "name": "blocking solution",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "reagent",
      "name": "primary antibody (e.g., OCT4)",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "reagent",
      "name": "secondary antibody",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "reagent",
      "name": "DAPI",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "reagent",
      "name": "Hoechst 33342",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "reagent",
      "name": "distilled water",
      "properties": {}
    },
    {
      "id": "e17",
      "type": "reagent",
      "name": "Mowiol",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "consumable",
      "name": "serological pipette (1 ml)",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "instrument",
      "name": "incubator (37 °C, 5 % CO₂)",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "instrument",
      "name": "37 °C water bath",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "instrument",
      "name": "tweezers",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "instrument",
      "name": "fluorescence microscope",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "e1",
        "e2"
      ],
      "params": {
        "note": "Prepare a sterile 24‑well plate and place sterile glass coverslips onto the bottom of each well. Prepare at least six wells."
      },
      "notes": ""
    },
    {
      "id": "s2",
      "op": "transfer",
      "inputs": [
        "e3"
      ],
      "outputs": [],
      "params": {
        "volume": "300 µl",
        "destination": "each well of e1"
      },
      "notes": ""
    },
    {
      "id": "s3",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "1 h",
        "temperature": "37 °C",
        "CO2": "5 %",
        "device": "e19"
      },
      "notes": ""
    },
    {
      "id": "s4",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "Matrigel/DMEM/F12 solution",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s5",
      "op": "transfer",
      "inputs": [
        "e4",
        "e5"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "additives": "10 µM Rock inhibitor",
        "destination": "each well of e1"
      },
      "notes": ""
    },
    {
      "id": "s6",
      "op": "manipulate",
      "inputs": [
        "e6"
      ],
      "outputs": [],
      "params": {
        "action": "seed",
        "method": "one drop with 1 ml serological pipette (e18) into each well",
        "post_action": "place plate in incubator (e19) at 37 °C, 5 % CO₂, do not move for 24–48 h"
      },
      "notes": ""
    },
    {
      "id": "s7",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Check for cell attachment after 2 days and change medium daily."
    },
    {
      "id": "s8",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "When iPSC colonies/patches have reached a diameter of 200–500 µm, proceed with fixation."
    },
    {
      "id": "s9",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "medium",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s10",
      "op": "transfer",
      "inputs": [
        "e7"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "prewarmed": true,
        "temperature": "37 °C",
        "device": "e20",
        "destination": "each well"
      },
      "notes": ""
    },
    {
      "id": "s11",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "DMEM/F12",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s12",
      "op": "transfer",
      "inputs": [
        "e8"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "prewarmed": true,
        "temperature": "37 °C",
        "device": "e20",
        "destination": "each well"
      },
      "notes": ""
    },
    {
      "id": "s13",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "10 min",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s14",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "PFA",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s15",
      "op": "transfer",
      "inputs": [
        "e9"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "destination": "each well",
        "repeat": 3,
        "note": "CRITICAL: Perform washing steps carefully not to detach fixed adherent cells."
      },
      "notes": ""
    },
    {
      "id": "s16",
      "op": "transfer",
      "inputs": [
        "e10"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "destination": "each well"
      },
      "notes": ""
    },
    {
      "id": "s17",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "10 min",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s18",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "permeabilization solution",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s19",
      "op": "transfer",
      "inputs": [
        "e9"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "destination": "each well",
        "repeat": 3
      },
      "notes": ""
    },
    {
      "id": "s20",
      "op": "transfer",
      "inputs": [
        "e11"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "destination": "each well"
      },
      "notes": ""
    },
    {
      "id": "s21",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: Store plate at 4 °C for up to 2 weeks wrapped with Parafilm, or proceed after 1 h incubation at RT with blocking solution."
    },
    {
      "id": "s22",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Dilute the first primary antibody as recommended (e.g., OCT4) in blocking buffer."
    },
    {
      "id": "s23",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "blocking solution",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s24",
      "op": "transfer",
      "inputs": [
        "e12"
      ],
      "outputs": [],
      "params": {
        "volume": "200 µl",
        "destination": "each well",
        "incubation": {
          "duration": "1 h",
          "temperature": "RT",
          "alternative": "overnight at 4 °C"
        }
      },
      "notes": ""
    },
    {
      "id": "s25",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "primary antibody",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s26",
      "op": "transfer",
      "inputs": [
        "e11"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "destination": "each well",
        "repeat": 3
      },
      "notes": ""
    },
    {
      "id": "s27",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "blocking solution",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s28",
      "op": "transfer",
      "inputs": [
        "e13"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "destination": "each well",
        "incubation": {
          "duration": "1 h",
          "temperature": "RT",
          "note": "protect from light"
        }
      },
      "notes": "CRITICAL: Keep plate in the dark from now on because secondary antibodies are light sensitive."
    },
    {
      "id": "s29",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "secondary antibody",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s30",
      "op": "transfer",
      "inputs": [
        "e11"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "destination": "each well",
        "repeat": 3
      },
      "notes": ""
    },
    {
      "id": "s31",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Repeat steps s23–s30 for additional primary/secondary antibody pairs. Add DAPI or Hoechst 33342 at a final concentration of 0.1–0.5 µg/ml (DAPI) or 1–5 µg/ml (Hoechst) to the last secondary antibody incubation."
    },
    {
      "id": "s32",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "aspirate",
        "source": "blocking solution",
        "from": "each well"
      },
      "notes": ""
    },
    {
      "id": "s33",
      "op": "transfer",
      "inputs": [
        "e16"
      ],
      "outputs": [],
      "params": {
        "volume": "500 µl",
        "destination": "each well"
      },
      "notes": ""
    },
    {
      "id": "s34",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "remove",
        "object": "glass coverslip",
        "tool": "e21",
        "from": "each well"
      },
      "notes": "Place coverslip with cells on top of paper for 5 min at RT protected from light."
    },
    {
      "id": "s35",
      "op": "transfer",
      "inputs": [
        "e17"
      ],
      "outputs": [],
      "params": {
        "volume": "3 µl",
        "destination": "glass slide",
        "note": "drop of Mowiol"
      },
      "notes": ""
    },
    {
      "id": "s36",
      "op": "manipulate",
      "inputs": [],
      "outputs": [],
      "params": {
        "action": "place",
        "object": "coverslip",
        "onto": "Mowiol drop",
        "method": "touch only rim",
        "note": "flip coverslip, avoid air bubbles"
      },
      "notes": ""
    },
    {
      "id": "s37",
      "op": "incubate",
      "inputs": [],
      "outputs": [],
      "params": {
        "duration": "15–30 min",
        "temperature": "RT",
        "note": "protected from light"
      },
      "notes": ""
    },
    {
      "id": "s38",
      "op": "observe",
      "inputs": [],
      "outputs": [],
      "params": {
        "device": "e22",
        "mode": "fluorescence microscopy"
      },
      "notes": "PAUSE POINT: Slides can be stored at 4 °C protected from light for up to 6 months before imaging."
    }
  ]
}