{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-023-00814-x",
    "title": "Procedure",
    "source": "s41596-023-00814-x.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "unknown",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": true,
    "contamination_control": [
      "sterile technique"
    ]
  },
  "entities": [
    {
      "id": "sample_organoid",
      "type": "sample",
      "name": "OVB organoid",
      "properties": {}
    },
    {
      "id": "reagent_pfa",
      "type": "reagent",
      "name": "4% paraformaldehyde (PFA)",
      "properties": {}
    },
    {
      "id": "reagent_dmem",
      "type": "reagent",
      "name": "DMEM/F12",
      "properties": {}
    },
    {
      "id": "reagent_pbs",
      "type": "reagent",
      "name": "PBS",
      "properties": {}
    },
    {
      "id": "reagent_sucrose",
      "type": "reagent",
      "name": "30% (wt/vol) sucrose in PBS",
      "properties": {}
    },
    {
      "id": "reagent_oct",
      "type": "reagent",
      "name": "Tissue‑Tek OCT Compound",
      "properties": {}
    },
    {
      "id": "reagent_pll",
      "type": "reagent",
      "name": "Poly‑L‑lysine (PLL) 0.1% solution",
      "properties": {}
    },
    {
      "id": "reagent_sds",
      "type": "reagent",
      "name": "1% sodium dodecyl sulfate (SDS) in PBS",
      "properties": {}
    },
    {
      "id": "reagent_pbs_glycine",
      "type": "reagent",
      "name": "PBS‑Glycine (0.225 g Glycine per 100 ml)",
      "properties": {}
    },
    {
      "id": "reagent_permeab",
      "type": "reagent",
      "name": "Permeabilization solution",
      "properties": {}
    },
    {
      "id": "reagent_block",
      "type": "reagent",
      "name": "Blocking solution",
      "properties": {}
    },
    {
      "id": "reagent_primary",
      "type": "reagent",
      "name": "Primary antibodies (diluted in blocking solution)",
      "properties": {}
    },
    {
      "id": "reagent_secondary",
      "type": "reagent",
      "name": "Secondary antibodies with DAPI (1:500 in blocking solution)",
      "properties": {}
    },
    {
      "id": "reagent_sodium_citrate",
      "type": "reagent",
      "name": "10 mM sodium citrate buffer, pH 6",
      "properties": {}
    },
    {
      "id": "reagent_mowiol",
      "type": "reagent",
      "name": "Mowiol mounting medium",
      "properties": {}
    },
    {
      "id": "reagent_distilled_water",
      "type": "reagent",
      "name": "Distilled water",
      "properties": {}
    },
    {
      "id": "reagent_parafilm",
      "type": "reagent",
      "name": "Parafilm (cut to slide size)",
      "properties": {}
    },
    {
      "id": "container_tube",
      "type": "container",
      "name": "Sterile 1 ml tube",
      "properties": {}
    },
    {
      "id": "container_mold",
      "type": "container",
      "name": "Tissue‑Tek Cryomold",
      "properties": {}
    },
    {
      "id": "container_slide",
      "type": "container",
      "name": "Superfrost glass slide",
      "properties": {}
    },
    {
      "id": "container_coplin",
      "type": "container",
      "name": "Coplin jar",
      "properties": {}
    },
    {
      "id": "container_coverslip",
      "type": "container",
      "name": "Glass coverslip (24 × 50 mm)",
      "properties": {}
    },
    {
      "id": "consumable_tip_1000",
      "type": "consumable",
      "name": "Cut 1,000 µl micropipette tip",
      "properties": {}
    },
    {
      "id": "consumable_tip_200",
      "type": "consumable",
      "name": "Cut 200 µl micropipette tip",
      "properties": {}
    },
    {
      "id": "consumable_loop",
      "type": "consumable",
      "name": "Inoculation loop",
      "properties": {}
    },
    {
      "id": "instrument_waterbath",
      "type": "instrument",
      "name": "37 °C water bath",
      "properties": {}
    },
    {
      "id": "instrument_freezer",
      "type": "instrument",
      "name": "-80 °C freezer",
      "properties": {}
    },
    {
      "id": "instrument_cryostat",
      "type": "instrument",
      "name": "Cryostat (cryosection machine)",
      "properties": {}
    },
    {
      "id": "instrument_microscope",
      "type": "instrument",
      "name": "Light microscope",
      "properties": {}
    },
    {
      "id": "instrument_microwave",
      "type": "instrument",
      "name": "Microwave (for antigen retrieval)",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "allocate",
      "inputs": [],
      "outputs": [
        "reagent_pfa",
        "reagent_dmem",
        "reagent_pbs",
        "reagent_sucrose",
        "reagent_oct",
        "container_mold",
        "container_slide",
        "reagent_pll",
        "reagent_sds"
      ],
      "params": {},
      "notes": "Prepare all reagents and containers listed in step 1."
    },
    {
      "id": "s2",
      "op": "run_device",
      "inputs": [
        "reagent_dmem",
        "reagent_pfa",
        "instrument_waterbath"
      ],
      "outputs": [
        "reagent_dmem",
        "reagent_pfa"
      ],
      "params": {
        "temperature": "37 °C",
        "duration": "prewarm"
      },
      "notes": "Prewarm DMEM/F12 and 4 % PFA in a 37 °C water bath."
    },
    {
      "id": "s3",
      "op": "transfer",
      "inputs": [
        "sample_organoid",
        "container_tube",
        "consumable_tip_1000"
      ],
      "outputs": [
        "sample_organoid"
      ],
      "params": {
        "volume": "up to 5 organoids",
        "destination": "container_tube"
      },
      "notes": "Collect up to five OVB organoids (day 30 or 60) into a sterile 1 ml tube using a cut 1,000 µl tip."
    },
    {
      "id": "s4",
      "op": "manipulate",
      "inputs": [
        "container_tube",
        "consumable_tip_200"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "action": "remove medium",
        "tool": "200 µl tip"
      },
      "notes": "Remove any carried‑over medium carefully without disturbing the organoids."
    },
    {
      "id": "s5",
      "op": "transfer",
      "inputs": [
        "reagent_dmem",
        "container_tube",
        "consumable_tip_200"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "volume": "1 ml",
        "temperature": "37 °C"
      },
      "notes": "Wash organoids once with 1 ml prewarmed DMEM/F12 for 3 min."
    },
    {
      "id": "s6",
      "op": "incubate",
      "inputs": [
        "container_tube"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "duration": "3 min",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s7",
      "op": "manipulate",
      "inputs": [
        "container_tube",
        "consumable_tip_200"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "action": "remove DMEM/F12"
      },
      "notes": ""
    },
    {
      "id": "s8",
      "op": "transfer",
      "inputs": [
        "reagent_pfa",
        "container_tube",
        "consumable_tip_200"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "volume": "1 ml",
        "temperature": "37 °C"
      },
      "notes": "Add 1 ml PFA and incubate at RT for 30–60 min."
    },
    {
      "id": "s9",
      "op": "incubate",
      "inputs": [
        "container_tube"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "duration": "30–60 min",
        "temperature": "RT"
      },
      "notes": "CRITICAL STEP: Do not exceed 1 h fixation to avoid high autofluorescence."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "container_tube",
        "consumable_tip_200"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "action": "remove PFA"
      },
      "notes": ""
    },
    {
      "id": "s11",
      "op": "wash",
      "inputs": [
        "container_tube",
        "reagent_pbs_glycine"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "cycles": 3,
        "volume_per_cycle": "1 ml",
        "duration_per_cycle": "3 min",
        "temperature": "RT"
      },
      "notes": "Three washes with PBS‑Glycine."
    },
    {
      "id": "s12",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: Organoids can be stored up to 2 months in PBS‑Glycine at 4 °C."
    },
    {
      "id": "s13",
      "op": "transfer",
      "inputs": [
        "reagent_sucrose",
        "container_tube",
        "consumable_tip_200"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "volume": "1 ml"
      },
      "notes": "Add 1 ml 30 % sucrose solution and keep at 4 °C overnight."
    },
    {
      "id": "s14",
      "op": "incubate",
      "inputs": [
        "container_tube"
      ],
      "outputs": [
        "container_tube"
      ],
      "params": {
        "duration": "overnight",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s15",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: Organoids can be stored up to 2 weeks in sucrose solution at 4 °C."
    },
    {
      "id": "s16",
      "op": "transfer",
      "inputs": [
        "container_tube",
        "container_mold",
        "reagent_oct",
        "consumable_tip_200",
        "consumable_loop"
      ],
      "outputs": [
        "container_mold"
      ],
      "params": {
        "action": "move organoid into OCT mold",
        "orientation": "center, pigmented side facing sides"
      },
      "notes": "Prepare Cryomold with OCT, transfer dehydrated organoid using a cut 200 µl tip or inoculation loop."
    },
    {
      "id": "s17",
      "op": "run_device",
      "inputs": [
        "container_mold",
        "instrument_freezer"
      ],
      "outputs": [
        "container_mold"
      ],
      "params": {
        "temperature": "-80 °C",
        "duration": "minimum 24 h"
      },
      "notes": "Deep freeze at -80 °C."
    },
    {
      "id": "s18",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: Molds with organoids can be stored up to 1 year at -80 °C."
    },
    {
      "id": "s19",
      "op": "manipulate",
      "inputs": [
        "reagent_pll",
        "container_slide",
        "instrument_waterbath"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "dilution": "0.1 % PLL 1:10 in distilled water",
        "soak_time": "5 min",
        "temperature": "RT",
        "dry_time": "2–3 h",
        "temperature_dry": "RT"
      },
      "notes": "Coat Superfrost slides with PLL, soak 5 min, remove and dry."
    },
    {
      "id": "s20",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: Dried slides can be stored up to 3 months at RT."
    },
    {
      "id": "s21",
      "op": "run_device",
      "inputs": [
        "container_mold",
        "instrument_cryostat"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "chamber_temperature": "20–25 °C",
        "cut_thickness": "12–16 µm",
        "action": "sectioning",
        "post_section_dry": "1 h at RT"
      },
      "notes": "Set up cryostat, trim to expose organoid, cut sections 12–16 µm, place on PLL‑coated slides, dry 1 h."
    },
    {
      "id": "s22",
      "op": "run_device",
      "inputs": [
        "container_slide",
        "instrument_freezer"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "temperature": "-80 °C",
        "duration": "minimum 2 h"
      },
      "notes": "Store cryosections at -80 °C until further processing."
    },
    {
      "id": "s23",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "PAUSE POINT: Slides can be stored up to 1 year at -80 °C."
    },
    {
      "id": "s24",
      "op": "incubate",
      "inputs": [
        "container_slide"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "action": "thaw",
        "temperature": "RT",
        "duration": "until fully thawed"
      },
      "notes": "Thaw slides at RT."
    },
    {
      "id": "s25",
      "op": "incubate",
      "inputs": [
        "container_slide"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "action": "dry",
        "duration": "30 min",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s26",
      "op": "wash",
      "inputs": [
        "container_slide",
        "reagent_pbs",
        "container_coplin"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "cycles": 2,
        "duration_per_cycle": "3 min",
        "temperature": "RT"
      },
      "notes": "Wash slides twice with PBS."
    },
    {
      "id": "s27",
      "op": "incubate",
      "inputs": [
        "container_slide",
        "reagent_sds"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "duration": "5 min",
        "temperature": "RT"
      },
      "notes": "Incubate with 1 % SDS in PBS."
    },
    {
      "id": "s28",
      "op": "wash",
      "inputs": [
        "container_slide",
        "reagent_pbs"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "cycles": 2,
        "duration_per_cycle": "3 min",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s29",
      "op": "incubate",
      "inputs": [
        "container_slide",
        "reagent_permeab"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "duration": "10 min",
        "temperature": "RT"
      },
      "notes": "Permeabilization."
    },
    {
      "id": "s30",
      "op": "wash",
      "inputs": [
        "container_slide",
        "reagent_pbs_glycine"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "cycles": 3,
        "duration_per_cycle": "3 min",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s31",
      "op": "incubate",
      "inputs": [
        "container_slide",
        "reagent_block"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "duration": "1 h",
        "temperature": "RT",
        "alternative": "overnight at 4 °C"
      },
      "notes": "Blocking step."
    },
    {
      "id": "s32",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Dilute primary antibodies in blocking solution (see Table 3). Perform heat‑induced antigen retrieval with 10 mM sodium citrate buffer (pH 6) using a microwave. Phalloidin staining requires 1 h incubation at RT protected from light."
    },
    {
      "id": "s33",
      "op": "incubate",
      "inputs": [
        "container_slide",
        "reagent_primary"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "volume": "100 µl",
        "cover": "Parafilm",
        "duration": "minimum 2 h",
        "temperature": "RT",
        "alternative": "overnight at 4 °C"
      },
      "notes": "Add primary antibody solution and cover with Parafilm."
    },
    {
      "id": "s34",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Primary antibody solution can be stored at 4 °C and reused up to three times within 3 months."
    },
    {
      "id": "s35",
      "op": "wash",
      "inputs": [
        "container_slide",
        "reagent_block"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "cycles": 3,
        "duration_per_cycle": "5 min",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s36",
      "op": "incubate",
      "inputs": [
        "container_slide",
        "reagent_secondary"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "duration": "1–2 h",
        "temperature": "RT",
        "alternative": "overnight at 4 °C",
        "light_protection": true
      },
      "notes": "Secondary antibody with DAPI (1:500)."
    },
    {
      "id": "s37",
      "op": "manipulate",
      "inputs": [
        "container_slide",
        "consumable_tip_200"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "action": "remove secondary antibody solution"
      },
      "notes": ""
    },
    {
      "id": "s38",
      "op": "wash",
      "inputs": [
        "container_slide",
        "reagent_block"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "cycles": 3,
        "duration_per_cycle": "5 min",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s39",
      "op": "observe",
      "inputs": [
        "container_slide",
        "instrument_microscope"
      ],
      "outputs": [],
      "params": {
        "observation": "DAPI nuclear staining and antibody signal"
      },
      "notes": "Briefly check under microscope."
    },
    {
      "id": "s40",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Optional: repeat steps 33–39 for co‑staining with additional primary/secondary antibodies (no DAPI needed for subsequent rounds)."
    },
    {
      "id": "s41",
      "op": "wash",
      "inputs": [
        "container_slide",
        "reagent_distilled_water"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "action": "final wash",
        "duration": "brief"
      },
      "notes": "Final wash with distilled water."
    },
    {
      "id": "s42",
      "op": "incubate",
      "inputs": [
        "container_slide"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "duration": "10 min",
        "temperature": "RT",
        "action": "air‑dry"
      },
      "notes": ""
    },
    {
      "id": "s43",
      "op": "manipulate",
      "inputs": [
        "container_slide",
        "reagent_mowiol",
        "container_coverslip"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "volume": "three drops Mowiol",
        "coverslip": "24 × 50 mm",
        "air_bubbles": "avoid"
      },
      "notes": "Add Mowiol and place coverslip."
    },
    {
      "id": "s44",
      "op": "incubate",
      "inputs": [
        "container_slide"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "duration": "1 h",
        "temperature": "RT",
        "light_protection": true
      },
      "notes": "Dry slide with Mowiol, protect from light."
    },
    {
      "id": "s45",
      "op": "manipulate",
      "inputs": [
        "container_slide"
      ],
      "outputs": [
        "container_slide"
      ],
      "params": {
        "storage_temperature": "4 °C",
        "light_condition": "dark"
      },
      "notes": "Store slides long‑term at 4 °C in the dark until microscopy."
    }
  ]
}