{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-023-00814-x",
    "title": "Procedure",
    "source": "s41596-023-00814-x.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "unknown",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": true,
    "contamination_control": [
      "RNase-free"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "OVB organoids in RNase‑free 1.5 ml tube",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "container",
      "name": "RNase‑free 1.5 ml tube",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "consumable",
      "name": "cut 1,000 µl micropipette tip",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "consumable",
      "name": "200 µl micropipette tip (RNase‑free, filtered)",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "cold PBS",
      "properties": {}
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "Tri‑Reagent",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "instrument",
      "name": "Vortex mixer",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "consumable",
      "name": "dry ice",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "instrument",
      "name": "-80 °C freezer",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "commercial RNA extraction kit",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "sample",
      "name": "total RNA (2 µg)",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "reagent",
      "name": "poly(A)+ selection kit",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "sample",
      "name": "strand‑specific cDNA library",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "instrument",
      "name": "Illumina HiSeq4000 sequencer",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "software",
      "name": "FastQC",
      "properties": {}
    },
    {
      "id": "e16",
      "type": "software",
      "name": "STAR aligner",
      "properties": {}
    },
    {
      "id": "e17",
      "type": "software",
      "name": "featureCounts",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "software",
      "name": "RUVSeq package",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "software",
      "name": "DESeq2 package",
      "properties": {}
    },
    {
      "id": "e20",
      "type": "software",
      "name": "APcluster package",
      "properties": {}
    },
    {
      "id": "e21",
      "type": "software",
      "name": "clusterProfiler package",
      "properties": {}
    },
    {
      "id": "e22",
      "type": "software",
      "name": "GSEA v3.0",
      "properties": {}
    },
    {
      "id": "e23",
      "type": "data",
      "name": "sequencing reads (FASTQ)",
      "properties": {}
    },
    {
      "id": "e24",
      "type": "data",
      "name": "FastQC quality report",
      "properties": {}
    },
    {
      "id": "e25",
      "type": "data",
      "name": "STAR‑aligned reads (BAM)",
      "properties": {}
    },
    {
      "id": "e26",
      "type": "data",
      "name": "gene‑level read counts",
      "properties": {}
    },
    {
      "id": "e27",
      "type": "data",
      "name": "RUVSeq‑normalized counts",
      "properties": {}
    },
    {
      "id": "e28",
      "type": "data",
      "name": "DESeq2 differential expression results",
      "properties": {}
    },
    {
      "id": "e29",
      "type": "data",
      "name": "APcluster affinity‑propagation clusters",
      "properties": {}
    },
    {
      "id": "e30",
      "type": "data",
      "name": "clusterProfiler GO enrichment results",
      "properties": {}
    },
    {
      "id": "e31",
      "type": "data",
      "name": "GSEA enrichment results",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "transfer",
      "inputs": [],
      "outputs": [
        "e1"
      ],
      "params": {
        "method": "cut 1,000 µl tip",
        "description": "Collect up to three OVB organoids of the same batch into a sterile RNase‑free 1.5 ml tube"
      },
      "notes": ""
    },
    {
      "id": "s2",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "remove carried‑over medium",
        "tip": "200 µl micropipette tip"
      },
      "notes": ""
    },
    {
      "id": "s3",
      "op": "transfer",
      "inputs": [
        "e5"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "wash organoids once with cold PBS"
      },
      "notes": ""
    },
    {
      "id": "s4",
      "op": "transfer",
      "inputs": [
        "e6"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "300 µl",
        "post_incubation": "RT 5 min"
      },
      "notes": ""
    },
    {
      "id": "s5",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "temperature": "RT",
        "duration": "5 min"
      },
      "notes": ""
    },
    {
      "id": "s6",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "device": "Vortex mixer",
        "duration": "5 s",
        "repetitions": 3
      },
      "notes": ""
    },
    {
      "id": "s7",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "temperature": "RT",
        "duration": "5 min",
        "agitation": "none"
      },
      "notes": ""
    },
    {
      "id": "s8",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "device": "Vortex mixer",
        "duration": "5 s",
        "repetitions": 3
      },
      "notes": ""
    },
    {
      "id": "s9",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "temperature": "0 °C (on ice)",
        "duration": "10 min"
      },
      "notes": ""
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "device": "Vortex mixer",
        "duration": "5 s",
        "repetitions": 3
      },
      "notes": ""
    },
    {
      "id": "s11",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "temperature": "0 °C (on ice)",
        "duration": "10 min"
      },
      "notes": ""
    },
    {
      "id": "s12",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "snap freeze on dry ice"
      },
      "notes": ""
    },
    {
      "id": "s13",
      "op": "run_device",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "device": "-80 °C freezer",
        "duration": "overnight",
        "note": "Store organoids in Tri‑Reagent at -80 °C for up to 6 months"
      },
      "notes": ""
    },
    {
      "id": "s14",
      "op": "annotate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "note": "PAUSE POINT: organoids can be stored in Tri‑Reagent at -80 °C for up to 6 months"
      },
      "notes": ""
    },
    {
      "id": "s15",
      "op": "incubate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "thaw organoids in Tri‑Reagent",
        "temperature": "RT"
      },
      "notes": ""
    },
    {
      "id": "s16",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "device": "Vortex mixer",
        "duration": "5 s",
        "repetitions": "unspecified"
      },
      "notes": ""
    },
    {
      "id": "s17",
      "op": "manipulate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "pipette remaining cell clumps up and down for complete dissociation",
        "tip": "200 µl filtered RNase‑free tip"
      },
      "notes": ""
    },
    {
      "id": "s18",
      "op": "annotate",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "note": "Perform phenol/chloroform extraction and extract RNA with a commercial RNA extraction kit"
      },
      "notes": ""
    },
    {
      "id": "s19",
      "op": "transfer",
      "inputs": [
        "e10"
      ],
      "outputs": [
        "e11"
      ],
      "params": {
        "action": "extract RNA from organoid lysate"
      },
      "notes": ""
    },
    {
      "id": "s20",
      "op": "transfer",
      "inputs": [
        "e11",
        "e12"
      ],
      "outputs": [
        "e13"
      ],
      "params": {
        "input_amount": "2 µg total RNA",
        "action": "subselect poly(A)+ transcripts and generate strand‑specific cDNA library"
      },
      "notes": ""
    },
    {
      "id": "s21",
      "op": "run_device",
      "inputs": [
        "e13"
      ],
      "outputs": [
        "e23"
      ],
      "params": {
        "device": "Illumina HiSeq4000",
        "read_pairs": "~50 million",
        "read_length": "75 bp"
      },
      "notes": ""
    },
    {
      "id": "s22",
      "op": "run_device",
      "inputs": [
        "e23"
      ],
      "outputs": [
        "e24"
      ],
      "params": {
        "software": "FastQC",
        "action": "assess sequencing quality"
      },
      "notes": ""
    },
    {
      "id": "s23",
      "op": "run_device",
      "inputs": [
        "e24"
      ],
      "outputs": [
        "e25"
      ],
      "params": {
        "software": "STAR aligner",
        "reference": "Hg19 human genome",
        "action": "map paired‑end reads"
      },
      "notes": ""
    },
    {
      "id": "s24",
      "op": "run_device",
      "inputs": [
        "e25"
      ],
      "outputs": [
        "e26"
      ],
      "params": {
        "software": "featureCounts",
        "action": "quantify gene‑level read counts"
      },
      "notes": ""
    },
    {
      "id": "s25",
      "op": "run_device",
      "inputs": [
        "e26"
      ],
      "outputs": [
        "e27"
      ],
      "params": {
        "software": "RUVSeq package",
        "action": "normalize raw read counts"
      },
      "notes": ""
    },
    {
      "id": "s26",
      "op": "run_device",
      "inputs": [
        "e27"
      ],
      "outputs": [
        "e28"
      ],
      "params": {
        "software": "DESeq2 package",
        "action": "perform differential gene expression analysis"
      },
      "notes": ""
    },
    {
      "id": "s27",
      "op": "run_device",
      "inputs": [
        "e28"
      ],
      "outputs": [
        "e29"
      ],
      "params": {
        "software": "APcluster package",
        "action": "affinity‑propagation clustering of significant DGE genes"
      },
      "notes": ""
    },
    {
      "id": "s28",
      "op": "run_device",
      "inputs": [
        "e29"
      ],
      "outputs": [
        "e30"
      ],
      "params": {
        "software": "clusterProfiler package",
        "action": "generate dendrogram, define clusters and perform GO term enrichment"
      },
      "notes": ""
    },
    {
      "id": "s29",
      "op": "run_device",
      "inputs": [
        "e30"
      ],
      "outputs": [
        "e31"
      ],
      "params": {
        "software": "GSEA v3.0",
        "gene_sets": "C5 collection (GO)",
        "action": "gene set enrichment analysis"
      },
      "notes": ""
    }
  ]
}