{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-023-00814-x",
    "title": "Procedure",
    "source": "s41596-023-00814-x.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "unknown",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": false,
    "sterility_required": true,
    "contamination_control": []
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "OVB organoids",
      "properties": {}
    },
    {
      "id": "e2",
      "type": "reagent",
      "name": "2.5% glutaraldehyde, 1.8% sucrose in PBS (pH 7.2)",
      "properties": {
        "concentration_glutaraldehyde": "2.5%",
        "concentration_sucrose": "1.8%",
        "pH": "7.2"
      }
    },
    {
      "id": "e3",
      "type": "reagent",
      "name": "PBS",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "reagent",
      "name": "Distilled water",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "1% aqueous osmium tetroxide",
      "properties": {
        "concentration": "1%"
      }
    },
    {
      "id": "e6",
      "type": "reagent",
      "name": "Ethanol series",
      "properties": {
        "concentrations": [
          "50%",
          "75%",
          "95%",
          "100%"
        ]
      }
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "Propylene oxide",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "Embedding resin (Epon‑Araldite)",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "reagent",
      "name": "Uranyl acetate (2% wt/vol)",
      "properties": {
        "concentration": "2% wt/vol"
      }
    },
    {
      "id": "e10",
      "type": "reagent",
      "name": "Methanol (70%)",
      "properties": {
        "percentage": "70%"
      }
    },
    {
      "id": "e11",
      "type": "reagent",
      "name": "Reynold’s lead citrate",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "container",
      "name": "Microcentrifuge tube (5 ml)",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "container",
      "name": "Flat embedding mold",
      "properties": {}
    },
    {
      "id": "e14",
      "type": "instrument",
      "name": "Wheel rotator",
      "properties": {}
    },
    {
      "id": "e15",
      "type": "instrument",
      "name": "Incubator (4 °C)",
      "properties": {
        "temperature": "4 °C"
      }
    },
    {
      "id": "e16",
      "type": "instrument",
      "name": "Oven (60–62 °C)",
      "properties": {
        "temperature_range": "60–62 °C"
      }
    },
    {
      "id": "e17",
      "type": "instrument",
      "name": "Rheichert ultramicrotome",
      "properties": {}
    },
    {
      "id": "e18",
      "type": "instrument",
      "name": "Formvar‑coated copper grid (single hole)",
      "properties": {}
    },
    {
      "id": "e19",
      "type": "instrument",
      "name": "Tecnai G2 Spirit EM (FEI) with Morada CCD camera (Olympus)",
      "properties": {}
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "incubate",
      "inputs": [
        "e1",
        "e2",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "3–4 ml",
        "duration": "overnight",
        "temperature": "4 °C"
      },
      "notes": "Fix OVB organoids in glutaraldehyde/sucrose solution."
    },
    {
      "id": "s2",
      "op": "incubate",
      "inputs": [
        "e1",
        "e3",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "5 ml",
        "duration": "15 min",
        "repeat": 5
      },
      "notes": "Rinse samples five times in PBS."
    },
    {
      "id": "s3a",
      "op": "incubate",
      "inputs": [
        "e1",
        "e4",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "5 ml",
        "duration": "15 min",
        "repeat": 2
      },
      "notes": "Wash samples twice in distilled water."
    },
    {
      "id": "s3b",
      "op": "incubate",
      "inputs": [
        "e1",
        "e5",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "5 ml",
        "duration": "1–2 h",
        "temperature": "4 °C"
      },
      "notes": "Post‑fix in 1% osmium tetroxide."
    },
    {
      "id": "s4",
      "op": "incubate",
      "inputs": [
        "e1",
        "e6",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "steps": [
          {
            "concentration": "50%",
            "repeat": 2,
            "duration": "15 min"
          },
          {
            "concentration": "75%",
            "repeat": 2,
            "duration": "15 min"
          },
          {
            "concentration": "95%",
            "repeat": 2,
            "duration": "15 min"
          },
          {
            "concentration": "100%",
            "repeat": 2,
            "duration": "15 min"
          }
        ]
      },
      "notes": "Dehydrate organoids through graded ethanol series."
    },
    {
      "id": "s5",
      "op": "incubate",
      "inputs": [
        "e1",
        "e7",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "volume": "5 ml",
        "duration": "15 min"
      },
      "notes": "Incubate in propylene oxide (intermediate solvent)."
    },
    {
      "id": "s6",
      "op": "incubate",
      "inputs": [
        "e1",
        "e7",
        "e8",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "mixture": "propylene oxide:resin 2:1",
        "volume": "5 ml",
        "duration": "30 min",
        "temperature": "room temperature"
      },
      "notes": "First infiltration with propylene oxide/resin mixture."
    },
    {
      "id": "s7",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e14"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "agitate slowly on wheel rotator"
      },
      "notes": "Agitate very slowly on a wheel rotator."
    },
    {
      "id": "s7b",
      "op": "incubate",
      "inputs": [
        "e1",
        "e7",
        "e8",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "mixture": "propylene oxide:resin 1:1",
        "volume": "5 ml",
        "duration": "overnight",
        "temperature": "4 °C"
      },
      "notes": "Incubate overnight at 4 °C in 1:1 mixture."
    },
    {
      "id": "s8",
      "op": "incubate",
      "inputs": [
        "e1",
        "e8",
        "e12"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "medium": "pure embedding resin",
        "duration": "overnight",
        "temperature": "4 °C"
      },
      "notes": "Transfer samples to pure embedding resin overnight."
    },
    {
      "id": "s9",
      "op": "manipulate",
      "inputs": [
        "e1",
        "e13"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "action": "transfer to flat embedding molds and orient"
      },
      "notes": "Place organoids in flat embedding molds, properly oriented."
    },
    {
      "id": "s10",
      "op": "incubate",
      "inputs": [
        "e1",
        "e16"
      ],
      "outputs": [
        "e1"
      ],
      "params": {
        "duration": "48 h",
        "temperature": "60–62 °C"
      },
      "notes": "Polymerize resin, then cut block with razor blade to expose sample."
    },
    {
      "id": "s11",
      "op": "run_device",
      "inputs": [
        "e1",
        "e17",
        "e18"
      ],
      "outputs": [
        "e18"
      ],
      "params": {
        "device": "Rheichert ultramicrotome",
        "section_thickness": "400–500 nm",
        "collector": "formvar‑coated copper grid (single hole)"
      },
      "notes": "Obtain ultrathin sections and collect on grids."
    },
    {
      "id": "s12",
      "op": "annotate",
      "inputs": [
        "e18",
        "e9",
        "e10"
      ],
      "outputs": [
        "e18"
      ],
      "params": {},
      "notes": "Counter‑stain grids: either 2% uranyl acetate in 70% methanol for 7 min OR 2% uranyl acetate in distilled water for 20 min."
    },
    {
      "id": "s13",
      "op": "annotate",
      "inputs": [
        "e18",
        "e10",
        "e4"
      ],
      "outputs": [
        "e18"
      ],
      "params": {},
      "notes": "Wash grids in four drops of 70% methanol followed by five drops of distilled water."
    },
    {
      "id": "s14",
      "op": "incubate",
      "inputs": [
        "e18",
        "e11"
      ],
      "outputs": [
        "e18"
      ],
      "params": {
        "duration": "2–3 min"
      },
      "notes": "Transfer grids to a drop of Reynold’s lead citrate."
    },
    {
      "id": "s15",
      "op": "annotate",
      "inputs": [
        "e18",
        "e4"
      ],
      "outputs": [
        "e18"
      ],
      "params": {},
      "notes": "Wash grids in five drops of distilled water and dry at room temperature."
    },
    {
      "id": "s16",
      "op": "observe",
      "inputs": [
        "e18",
        "e19"
      ],
      "outputs": [],
      "params": {
        "instrument": "Tecnai G2 Spirit EM (FEI) with Morada CCD camera (Olympus)"
      },
      "notes": "Perform TEM observations of the sections."
    }
  ]
}