{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-023-00814-x",
    "title": "Procedure",
    "source": "Nature Protocols",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "unknown",
    "contains_human_or_animal_material": false,
    "requires_irb_or_iacuc": false,
    "sterility_required": true,
    "contamination_control": [
      "sterile technique"
    ]
  },
  "entities": [
    {
      "id": "e1",
      "type": "sample",
      "name": "OVB organoids (day 60)",
      "properties": {
        "count_range": "3-5"
      }
    },
    {
      "id": "e2",
      "type": "container",
      "name": "15 ml sterile centrifuge tube",
      "properties": {}
    },
    {
      "id": "e3",
      "type": "consumable",
      "name": "1,000 µl cut micropipette tip",
      "properties": {}
    },
    {
      "id": "e4",
      "type": "consumable",
      "name": "200 µl micropipette tip",
      "properties": {}
    },
    {
      "id": "e5",
      "type": "reagent",
      "name": "DMEM/F12",
      "properties": {
        "prewarmed_temperature": "37 °C"
      }
    },
    {
      "id": "e6",
      "type": "instrument",
      "name": "water bath",
      "properties": {}
    },
    {
      "id": "e7",
      "type": "reagent",
      "name": "0.05 % Trypsin",
      "properties": {}
    },
    {
      "id": "e8",
      "type": "reagent",
      "name": "20 % FBS‑DMEM",
      "properties": {}
    },
    {
      "id": "e9",
      "type": "container",
      "name": "15 ml sterile centrifuge tube (second)",
      "properties": {}
    },
    {
      "id": "e10",
      "type": "instrument",
      "name": "centrifuge",
      "properties": {}
    },
    {
      "id": "e11",
      "type": "reagent",
      "name": "RPE medium (Table 6)",
      "properties": {}
    },
    {
      "id": "e12",
      "type": "container",
      "name": "laminin‑coated cell‑culture treated dish",
      "properties": {}
    },
    {
      "id": "e13",
      "type": "instrument",
      "name": "incubator",
      "properties": {
        "temperature": "37 °C",
        "CO2": "5 %"
      }
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "transfer",
      "inputs": [
        "e1"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "tool": "e3",
        "volume": null,
        "description": "Collect 3–5 OVB organoids (day 60) into a sterile 15 ml centrifuge tube using a cut 1,000 µl micropipette tip."
      },
      "notes": ""
    },
    {
      "id": "s2",
      "op": "manipulate",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "tool": "e4",
        "action": "remove carried‑over medium",
        "description": "Carefully remove any carried‑over medium without disturbing the organoids."
      },
      "notes": ""
    },
    {
      "id": "s3",
      "op": "transfer",
      "inputs": [
        "e5"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "volume": "1 ml",
        "description": "Add 1 ml DMEM/F12 (pre‑warmed to 37 °C in a water bath) to the tube."
      },
      "notes": ""
    },
    {
      "id": "s4",
      "op": "run_device",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "device": "e6",
        "temperature": "37 °C",
        "duration": "3 min",
        "description": "Incubate for 3 min to wash organoids."
      },
      "notes": ""
    },
    {
      "id": "s5",
      "op": "manipulate",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "action": "withdraw",
        "description": "Remove the DMEM/F12 wash solution."
      },
      "notes": ""
    },
    {
      "id": "s6",
      "op": "transfer",
      "inputs": [
        "e7"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "volume": "3 ml",
        "description": "Add 3 ml of 0.05 % Trypsin to the organoids."
      },
      "notes": ""
    },
    {
      "id": "s7",
      "op": "run_device",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "device": "e6",
        "temperature": "37 °C",
        "duration": "20 min",
        "description": "Incubate for 20 min to dissociate organoids."
      },
      "notes": ""
    },
    {
      "id": "s8",
      "op": "transfer",
      "inputs": [
        "e8"
      ],
      "outputs": [
        "e2"
      ],
      "params": {
        "volume": "6 ml",
        "description": "Add 6 ml of 20 % FBS‑DMEM to stop the trypsin reaction."
      },
      "notes": ""
    },
    {
      "id": "s9",
      "op": "transfer",
      "inputs": [
        "e2"
      ],
      "outputs": [
        "e9"
      ],
      "params": {
        "tool": "e4",
        "description": "Collect darkly pigmented aggregates into a separate 15 ml centrifuge tube."
      },
      "notes": ""
    },
    {
      "id": "s10",
      "op": "run_device",
      "inputs": [
        "e9"
      ],
      "outputs": [
        "e9"
      ],
      "params": {
        "device": "e10",
        "speed": "1,000 g",
        "duration": "3 min",
        "temperature": "RT",
        "description": "Centrifuge to pellet pigmented aggregates."
      },
      "notes": ""
    },
    {
      "id": "s11",
      "op": "transfer",
      "inputs": [
        "e11"
      ],
      "outputs": [
        "e9"
      ],
      "params": {
        "description": "Resuspend the pellet in RPE medium."
      },
      "notes": ""
    },
    {
      "id": "s12",
      "op": "transfer",
      "inputs": [
        "e9"
      ],
      "outputs": [
        "e12"
      ],
      "params": {
        "description": "Seed the resuspended aggregates onto laminin‑coated cell‑culture treated dishes."
      },
      "notes": ""
    },
    {
      "id": "s13",
      "op": "run_device",
      "inputs": [
        "e12"
      ],
      "outputs": [
        "e12"
      ],
      "params": {
        "device": "e13",
        "temperature": "37 °C",
        "CO2": "5 %",
        "description": "Incubate dishes."
      },
      "notes": ""
    },
    {
      "id": "s14",
      "op": "annotate",
      "inputs": [
        "e12"
      ],
      "outputs": [],
      "params": {
        "note": "Within the next 2 weeks, expanding colonies of pigmented cells can be observed as adherent monolayer sheets."
      },
      "notes": ""
    },
    {
      "id": "s15",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {
        "note": "Optional: pick pigmented colonies and transfer small aggregates to a new laminin‑coated TC‑treated dish for subculture."
      },
      "notes": ""
    }
  ]
}