{
  "ir_version": "0.4",
  "kind": "enzyme_hl_ir",
  "meta": {
    "protocol_id": "s41596-021-00629-8",
    "title": "Procedure",
    "source": "s41596-021-00629-8.pdf",
    "language": "en"
  },
  "registries": {
    "custom": {
      "device_kind": [],
      "action_kind": [],
      "modality": [],
      "features": []
    }
  },
  "settings": {
    "biosafety_level": "2",
    "contains_human_or_animal_material": true,
    "requires_irb_or_iacuc": true,
    "sterility_required": true,
    "contamination_control": [
      "aseptic technique"
    ]
  },
  "entities": [
    {
      "id": "reagent_hpsc_medium",
      "type": "reagent",
      "name": "standard hPSC culture medium",
      "properties": {
        "knockout_serum_replacement": "20%"
      }
    },
    {
      "id": "reagent_knockout_serum",
      "type": "reagent",
      "name": "KnockOut Serum Replacement",
      "properties": {}
    },
    {
      "id": "reagent_pbs",
      "type": "reagent",
      "name": "PBS w/o Ca/Mg",
      "properties": {}
    },
    {
      "id": "reagent_accutase",
      "type": "reagent",
      "name": "Accutase",
      "properties": {}
    },
    {
      "id": "reagent_dmem_f12",
      "type": "reagent",
      "name": "DMEM/F12",
      "properties": {}
    },
    {
      "id": "reagent_e8",
      "type": "reagent",
      "name": "E8 medium",
      "properties": {}
    },
    {
      "id": "reagent_y27632",
      "type": "reagent",
      "name": "Y27632",
      "properties": {
        "concentration": "10 µM"
      }
    },
    {
      "id": "reagent_geltrex",
      "type": "reagent",
      "name": "Geltrex",
      "properties": {}
    },
    {
      "id": "reagent_matrigel",
      "type": "reagent",
      "name": "Matrigel",
      "properties": {
        "cat_no": "354234",
        "concentration_range": "9.7–10.7 mg/mL"
      }
    },
    {
      "id": "reagent_rb_minus",
      "type": "reagent",
      "name": "RB− basal medium",
      "properties": {}
    },
    {
      "id": "reagent_chir",
      "type": "reagent",
      "name": "CHIR99021",
      "properties": {
        "concentration": "7.5 µM"
      }
    },
    {
      "id": "reagent_iwp2",
      "type": "reagent",
      "name": "IWP2",
      "properties": {
        "concentration": "5 µM"
      }
    },
    {
      "id": "reagent_stemdiff_dissociation",
      "type": "reagent",
      "name": "STEMdiff Cardiomyocyte Dissociation Medium",
      "properties": {}
    },
    {
      "id": "reagent_stemdiff_support",
      "type": "reagent",
      "name": "STEMdiff Cardiomyocyte Support Medium",
      "properties": {}
    },
    {
      "id": "reagent_flow_buffer",
      "type": "reagent",
      "name": "Flow buffer",
      "properties": {}
    },
    {
      "id": "reagent_fixation_solution",
      "type": "reagent",
      "name": "Fixation solution (Fix & Perm kit)",
      "properties": {}
    },
    {
      "id": "reagent_permeabilising_B",
      "type": "reagent",
      "name": "Permeabilising medium B (Fix & Perm kit)",
      "properties": {}
    },
    {
      "id": "reagent_trypan_blue",
      "type": "reagent",
      "name": "Trypan blue",
      "properties": {}
    },
    {
      "id": "container_six_well_plate",
      "type": "container",
      "name": "Six‑well plate",
      "properties": {}
    },
    {
      "id": "container_t25_flask",
      "type": "container",
      "name": "T25 culture flask",
      "properties": {}
    },
    {
      "id": "container_15ml_conical",
      "type": "container",
      "name": "15 mL conical tube",
      "properties": {}
    },
    {
      "id": "container_96U_plate",
      "type": "container",
      "name": "U‑shaped ultra‑low attachment 96‑well plate",
      "properties": {}
    },
    {
      "id": "container_v_shaped_plate",
      "type": "container",
      "name": "V‑shaped 96‑well plate",
      "properties": {}
    },
    {
      "id": "container_12well_plate",
      "type": "container",
      "name": "12‑well suspension plate",
      "properties": {}
    },
    {
      "id": "instrument_incubator",
      "type": "instrument",
      "name": "Humidified 37 °C CO₂ incubator",
      "properties": {}
    },
    {
      "id": "instrument_water_bath",
      "type": "instrument",
      "name": "Water bath",
      "properties": {}
    },
    {
      "id": "instrument_centrifuge",
      "type": "instrument",
      "name": "Centrifuge",
      "properties": {}
    },
    {
      "id": "instrument_thermomixer",
      "type": "instrument",
      "name": "Thermomixer",
      "properties": {}
    },
    {
      "id": "instrument_microscope",
      "type": "instrument",
      "name": "Inverted microscope",
      "properties": {}
    },
    {
      "id": "instrument_flow_cytometer",
      "type": "instrument",
      "name": "Flow cytometer",
      "properties": {}
    },
    {
      "id": "consumable_pipette_1ml",
      "type": "consumable",
      "name": "1 mL pipette",
      "properties": {}
    },
    {
      "id": "consumable_pipette_3ml",
      "type": "consumable",
      "name": "3 mL pipette",
      "properties": {}
    },
    {
      "id": "consumable_pipette_10ul",
      "type": "consumable",
      "name": "10 µL pipette tip (cut tip)",
      "properties": {}
    },
    {
      "id": "consumable_pipette_20ul",
      "type": "consumable",
      "name": "20 µL pipette tip",
      "properties": {}
    },
    {
      "id": "consumable_pipette_100ul",
      "type": "consumable",
      "name": "100 µL pipette tip",
      "properties": {}
    },
    {
      "id": "consumable_scissors",
      "type": "consumable",
      "name": "Sterile scissors",
      "properties": {
        "preheat": "≥180 °C for ≥3 h"
      }
    }
  ],
  "steps": [
    {
      "id": "s1",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Initiation of 2D monolayer culture of hPSCs (Timing 10–20 min plus 2–4 d for maintenance)."
    },
    {
      "id": "s2",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Option A: Initiation from colonies on MEFs (Timing 20 min)."
    },
    {
      "id": "s3",
      "op": "transfer",
      "inputs": [
        "container_six_well_plate"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "volume": "500 µL",
        "reagent": "reagent_accutase"
      },
      "notes": "Aspirate medium, wash well with 3 mL PBS w/o, add 500 µL Accutase, incubate 3 min at 37 °C."
    },
    {
      "id": "s4",
      "op": "manipulate",
      "inputs": [
        "reagent_accutase"
      ],
      "outputs": [
        "reagent_cell_suspension"
      ],
      "params": {
        "action": "pipette to disperse colonies",
        "volume": "3 mL",
        "reagent": "reagent_dmem_f12"
      },
      "notes": "Add 3 mL DMEM/F12, pipette until single cells detached."
    },
    {
      "id": "s5",
      "op": "transfer",
      "inputs": [
        "reagent_cell_suspension"
      ],
      "outputs": [
        "container_15ml_conical"
      ],
      "params": {
        "volume": "≈1 mL"
      },
      "notes": "Transfer cell suspension to 15 mL conical tube."
    },
    {
      "id": "s6",
      "op": "centrifuge",
      "inputs": [
        "container_15ml_conical"
      ],
      "outputs": [
        "container_15ml_conical"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s7",
      "op": "manipulate",
      "inputs": [
        "container_15ml_conical"
      ],
      "outputs": [
        "reagent_cell_pellet"
      ],
      "params": {
        "action": "remove supernatant"
      },
      "notes": ""
    },
    {
      "id": "s8",
      "op": "manipulate",
      "inputs": [
        "reagent_cell_pellet"
      ],
      "outputs": [
        "reagent_resuspended_cells"
      ],
      "params": {
        "reagent": "reagent_e8",
        "additive": "reagent_y27632",
        "volume": "1 mL"
      },
      "notes": "Resuspend pellet in 1 mL E8 + 10 µM Y27632."
    },
    {
      "id": "s9",
      "op": "transfer",
      "inputs": [
        "reagent_resuspended_cells",
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "volume": "4 mL",
        "reagent": "reagent_e8 + Y27632"
      },
      "notes": "Add 4 mL E8 + 10 µM Y27632 to Geltrex‑coated T25 flask, then add cell suspension."
    },
    {
      "id": "s10",
      "op": "manipulate",
      "inputs": [
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "action": "rock/flask movement"
      },
      "notes": "Move flask back‑and‑forth to distribute cells evenly."
    },
    {
      "id": "s11",
      "op": "incubate",
      "inputs": [
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "duration": "2 d then daily",
        "temperature": "37 °C"
      },
      "notes": "Change medium after 2 d then daily with 5 mL fresh E8."
    },
    {
      "id": "s12",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Option B: Initiation from frozen monolayer stock (Timing 10 min)."
    },
    {
      "id": "s13",
      "op": "transfer",
      "inputs": [
        "reagent_frozen_vial"
      ],
      "outputs": [
        "container_15ml_conical"
      ],
      "params": {
        "volume": "10 mL",
        "reagent": "reagent_dmem_f12 (cold 4 °C)"
      },
      "notes": "Prepare 15 mL tube with 10 mL cold DMEM/F12, add vial content."
    },
    {
      "id": "s14",
      "op": "centrifuge",
      "inputs": [
        "container_15ml_conical"
      ],
      "outputs": [
        "container_15ml_conical"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s15",
      "op": "manipulate",
      "inputs": [
        "container_15ml_conical"
      ],
      "outputs": [
        "reagent_resuspended_cells"
      ],
      "params": {
        "reagent": "reagent_e8 + Y27632",
        "volume": "1 mL"
      },
      "notes": "Resuspend pellet in 1 mL E8 + 10 µM Y27632."
    },
    {
      "id": "s16",
      "op": "transfer",
      "inputs": [
        "reagent_resuspended_cells",
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "volume": "4 mL"
      },
      "notes": "Add cells to Geltrex‑coated T25 flask as in steps s9‑s10."
    },
    {
      "id": "s17",
      "op": "incubate",
      "inputs": [
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "duration": "2 d then daily",
        "temperature": "37 °C"
      },
      "notes": "Medium changes as in step s11."
    },
    {
      "id": "s18",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Passaging of hPSCs in monolayer culture (Timing 30 min)."
    },
    {
      "id": "s19",
      "op": "manipulate",
      "inputs": [
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "action": "aspirate medium"
      },
      "notes": "Aspirate medium, add 5 mL PBS w/o."
    },
    {
      "id": "s20",
      "op": "manipulate",
      "inputs": [
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "action": "add Accutase",
        "volume": "1 mL"
      },
      "notes": "Add 1 mL Accutase, incubate 3 min at 37 °C."
    },
    {
      "id": "s21",
      "op": "manipulate",
      "inputs": [
        "container_t25_flask"
      ],
      "outputs": [
        "reagent_cell_suspension"
      ],
      "params": {
        "action": "add 5 mL DMEM/F12 and rinse"
      },
      "notes": "Rinse bottom, collect cells into 15 mL tube."
    },
    {
      "id": "s22",
      "op": "centrifuge",
      "inputs": [
        "container_15ml_conical"
      ],
      "outputs": [
        "container_15ml_conical"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s23",
      "op": "manipulate",
      "inputs": [
        "container_15ml_conical"
      ],
      "outputs": [
        "reagent_resuspended_cells"
      ],
      "params": {
        "reagent": "reagent_e8 + Y27632",
        "volume": "1 mL"
      },
      "notes": "Resuspend pellet."
    },
    {
      "id": "s24",
      "op": "observe",
      "inputs": [
        "reagent_resuspended_cells"
      ],
      "outputs": [],
      "params": {
        "method": "hemocytometer with Trypan blue"
      },
      "notes": "Count cells and assess viability."
    },
    {
      "id": "s25",
      "op": "transfer",
      "inputs": [
        "reagent_resuspended_cells",
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "volume": "5 mL",
        "reagent": "reagent_e8 + Y27632"
      },
      "notes": "Seed 0.5–1.0 × 10⁶ cells into new Geltrex‑coated T25 flask."
    },
    {
      "id": "s26",
      "op": "incubate",
      "inputs": [
        "container_t25_flask"
      ],
      "outputs": [
        "container_t25_flask"
      ],
      "params": {
        "duration": "2 d then daily",
        "temperature": "37 °C"
      },
      "notes": "Change medium daily with 5 mL fresh E8 (no Y27632 after seeding)."
    },
    {
      "id": "s27",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Generation of HFOs – d‑4 cell seeding (Timing 45 min)."
    },
    {
      "id": "s28",
      "op": "manipulate",
      "inputs": [
        "container_t25_flask"
      ],
      "outputs": [
        "reagent_hpsc_cells"
      ],
      "params": {
        "action": "detach with Accutase",
        "duration": "as in step s20"
      },
      "notes": "Detach hPSCs at 80–90 % confluence."
    },
    {
      "id": "s29",
      "op": "manipulate",
      "inputs": [
        "reagent_hpsc_cells"
      ],
      "outputs": [
        "reagent_stock_suspension"
      ],
      "params": {
        "concentration": "5,000 cells / 100 µL",
        "reagent": "reagent_e8 + Y27632"
      },
      "notes": "Prepare stock cell suspension for desired number of HFOs."
    },
    {
      "id": "s30",
      "op": "transfer",
      "inputs": [
        "reagent_stock_suspension",
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "volume": "100 µL per well",
        "wells": "seed 12 extra wells"
      },
      "notes": "Seed 100 µL per well of ultra‑low attachment 96‑well plate."
    },
    {
      "id": "s31",
      "op": "centrifuge",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": "Bring cells to bottom of wells."
    },
    {
      "id": "s32",
      "op": "incubate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "duration": "≥24 h",
        "temperature": "37 °C"
      },
      "notes": "Do not move plate; allow round aggregate to form."
    },
    {
      "id": "s33",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "d‑2 Matrigel embedding (Timing 2 h)."
    },
    {
      "id": "s34",
      "op": "manipulate",
      "inputs": [
        "reagent_matrigel"
      ],
      "outputs": [
        "reagent_matrigel_thawed"
      ],
      "params": {
        "action": "thaw on ice"
      },
      "notes": "Thaw Matrigel aliquots on ice; keep on ice."
    },
    {
      "id": "s35",
      "op": "manipulate",
      "inputs": [
        "consumable_scissors"
      ],
      "outputs": [
        "consumable_cut_tip"
      ],
      "params": {
        "action": "cut pipette tip at ~90°"
      },
      "notes": "Prepare cut tip for aggregate picking."
    },
    {
      "id": "s36",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "action": "inspect aggregates under microscope"
      },
      "notes": "Mark properly formed round aggregates (~550–650 µm)."
    },
    {
      "id": "s37",
      "op": "manipulate",
      "inputs": [
        "consumable_pipette_20ul",
        "reagent_matrigel_thawed"
      ],
      "outputs": [
        "reagent_matrigel_droplet"
      ],
      "params": {
        "volume": "20 µL"
      },
      "notes": "Pipet 20 µL Matrigel into empty well; avoid bubbles."
    },
    {
      "id": "s38",
      "op": "manipulate",
      "inputs": [
        "consumable_cut_tip",
        "container_96U_plate"
      ],
      "outputs": [
        "aggregate_in_droplet"
      ],
      "params": {
        "action": "pick aggregate"
      },
      "notes": "Aspirate aggregate with cut tip, insert into Matrigel droplet; limit transferred medium ≤6 µL."
    },
    {
      "id": "s39",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "action": "repeat steps s37‑s38 for all aggregates"
      },
      "notes": "Use new tip for each droplet; incubate plate 50–60 min for solidification."
    },
    {
      "id": "s40",
      "op": "transfer",
      "inputs": [
        "reagent_e8",
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "volume": "100 µL per well"
      },
      "notes": "Add 100 µL E8 to each well after Matrigel solidifies."
    },
    {
      "id": "s41",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Differentiation steps (d0, d1, d3, d5, d7) – each Timing 30 min."
    },
    {
      "id": "s42",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "action": "remove medium without damaging Matrigel droplets"
      },
      "notes": "Follow method A or B described in Step 22; use 1000 µL or 20–200 µL tips as appropriate."
    },
    {
      "id": "s43",
      "op": "transfer",
      "inputs": [
        "reagent_rb_minus",
        "reagent_chir",
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "volume": "200 µL per well"
      },
      "notes": "Add RB− + 7.5 µM CHIR (light‑sensitive) on d0; lights off."
    },
    {
      "id": "s44",
      "op": "incubate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "duration": "24 h",
        "temperature": "37 °C"
      },
      "notes": "CHIR exposure for 24 h."
    },
    {
      "id": "s45",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "action": "remove CHIR‑containing medium"
      },
      "notes": "Repeat medium removal as in s42."
    },
    {
      "id": "s46",
      "op": "transfer",
      "inputs": [
        "reagent_rb_minus",
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "volume": "200 µL per well"
      },
      "notes": "Add RB− (no CHIR) on d1."
    },
    {
      "id": "s47",
      "op": "incubate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "duration": "24 h",
        "temperature": "37 °C"
      },
      "notes": ""
    },
    {
      "id": "s48",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "action": "remove medium"
      },
      "notes": "Day 3 medium removal."
    },
    {
      "id": "s49",
      "op": "transfer",
      "inputs": [
        "reagent_rb_minus",
        "reagent_iwp2",
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "volume": "200 µL per well"
      },
      "notes": "Add RB− + 5 µM IWP2 on d3."
    },
    {
      "id": "s50",
      "op": "incubate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "duration": "48 h",
        "temperature": "37 °C"
      },
      "notes": ""
    },
    {
      "id": "s51",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "action": "remove medium"
      },
      "notes": "Day 5 medium removal."
    },
    {
      "id": "s52",
      "op": "transfer",
      "inputs": [
        "reagent_rb_minus",
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "volume": "200 µL per well"
      },
      "notes": "Add RB− on d5."
    },
    {
      "id": "s53",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "action": "remove medium"
      },
      "notes": "Day 7 medium removal."
    },
    {
      "id": "s54",
      "op": "transfer",
      "inputs": [
        "reagent_rb_minus",
        "container_96U_plate"
      ],
      "outputs": [
        "container_96U_plate"
      ],
      "params": {
        "volume": "200 µL per well"
      },
      "notes": "Add RB− on d7; timing not critical."
    },
    {
      "id": "s55",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Monitoring and collection at d10 (Timing 30 min)."
    },
    {
      "id": "s56",
      "op": "observe",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "instrument": "instrument_microscope",
        "mode": "bright‑field and fluorescence"
      },
      "notes": "Image HFOs; optionally add 200 µL PBS w/o before imaging if fluorescence needed."
    },
    {
      "id": "s57",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Optional maintenance: change medium every 2–3 d with 200 µL RB+."
    },
    {
      "id": "s58",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Optional HFO removal for downstream assays (Step 30)."
    },
    {
      "id": "s59",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate",
        "consumable_pipette_1000ul",
        "consumable_scissors"
      ],
      "outputs": [
        "container_12well_plate"
      ],
      "params": {
        "action": "cut tip, aspirate HFO, transfer"
      },
      "notes": "Cut tip, hold plate at 45°, aspirate HFO, dispense into 12‑well plate."
    },
    {
      "id": "s60",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Dissociation for flow cytometry (Option A, Timing 2 h)."
    },
    {
      "id": "s61",
      "op": "manipulate",
      "inputs": [
        "instrument_thermomixer"
      ],
      "outputs": [],
      "params": {
        "action": "pre‑warm to 37 °C"
      },
      "notes": ""
    },
    {
      "id": "s62",
      "op": "transfer",
      "inputs": [
        "container_96U_plate",
        "container_v_shaped_plate"
      ],
      "outputs": [
        "container_v_shaped_plate"
      ],
      "params": {
        "action": "transfer HFOs (one per well)"
      },
      "notes": ""
    },
    {
      "id": "s63",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "remove medium as in s42"
      },
      "notes": ""
    },
    {
      "id": "s64",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "wash with 200 µL PBS w/o"
      },
      "notes": ""
    },
    {
      "id": "s65",
      "op": "transfer",
      "inputs": [
        "reagent_stemdiff_dissociation",
        "container_v_shaped_plate"
      ],
      "outputs": [
        "container_v_shaped_plate"
      ],
      "params": {
        "volume": "100 µL per well"
      },
      "notes": "Add dissociation medium, seal plate."
    },
    {
      "id": "s66",
      "op": "run_device",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [
        "container_v_shaped_plate"
      ],
      "params": {
        "device": "instrument_thermomixer",
        "temperature": "37 °C",
        "speed": "1,000 rpm",
        "duration": "12 min"
      },
      "notes": "Incubate for 12 min; attach plate with adhesive tape."
    },
    {
      "id": "s67",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "resuspend cells with multichannel pipette for ≤1 min"
      },
      "notes": ""
    },
    {
      "id": "s68",
      "op": "centrifuge",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [
        "container_v_shaped_plate"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s69",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "remove supernatant, add 100 µL flow buffer"
      },
      "notes": ""
    },
    {
      "id": "s70",
      "op": "centrifuge",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [
        "container_v_shaped_plate"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s71",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "wash with 100 µL flow buffer"
      },
      "notes": ""
    },
    {
      "id": "s72",
      "op": "centrifuge",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [
        "container_v_shaped_plate"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s73",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "resuspend in 50 µL fixation solution"
      },
      "notes": "Incubate 10 min at room temperature."
    },
    {
      "id": "s74",
      "op": "centrifuge",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [
        "container_v_shaped_plate"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s75",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "wash with 100 µL flow buffer"
      },
      "notes": ""
    },
    {
      "id": "s76",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "resuspend in 100 µL flow buffer"
      },
      "notes": "Cells ready for flow cytometry; pause point up to 1 week at 4 °C."
    },
    {
      "id": "s77",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "add 50 µL permeabilising B with antibodies"
      },
      "notes": "Incubate 30 min in dark at room temperature."
    },
    {
      "id": "s78",
      "op": "centrifuge",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [
        "container_v_shaped_plate"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s79",
      "op": "manipulate",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "action": "wash twice with 100 µL flow buffer"
      },
      "notes": ""
    },
    {
      "id": "s80",
      "op": "observe",
      "inputs": [
        "container_v_shaped_plate"
      ],
      "outputs": [],
      "params": {
        "instrument": "instrument_flow_cytometer"
      },
      "notes": "Acquire data on flow cytometer."
    },
    {
      "id": "s81",
      "op": "annotate",
      "inputs": [],
      "outputs": [],
      "params": {},
      "notes": "Option B: Dissociation for scRNA‑seq or replating (Timing 30 min)."
    },
    {
      "id": "s82",
      "op": "manipulate",
      "inputs": [
        "reagent_stemdiff_support"
      ],
      "outputs": [
        "reagent_support_prepared"
      ],
      "params": {
        "action": "prepare 500 µL per HFO with 10 µM Y27632"
      },
      "notes": ""
    },
    {
      "id": "s83",
      "op": "manipulate",
      "inputs": [
        "container_96U_plate"
      ],
      "outputs": [],
      "params": {
        "action": "dissociate using STEMdiff Dissociation Medium as in steps s65‑s67"
      },
      "notes": "HFOs may stay in same plate."
    },
    {
      "id": "s84",
      "op": "transfer",
      "inputs": [
        "container_96U_plate",
        "container_15ml_conical"
      ],
      "outputs": [
        "container_15ml_conical"
      ],
      "params": {
        "action": "collect dissociated cells"
      },
      "notes": ""
    },
    {
      "id": "s85",
      "op": "centrifuge",
      "inputs": [
        "container_15ml_conical"
      ],
      "outputs": [
        "container_15ml_conical"
      ],
      "params": {
        "speed": "300 g",
        "time": "3 min",
        "temperature": "4 °C"
      },
      "notes": ""
    },
    {
      "id": "s86",
      "op": "manipulate",
      "inputs": [
        "container_15ml_conical"
      ],
      "outputs": [],
      "params": {
        "action": "resuspend in appropriate buffer for scRNA‑seq or RB+ with 10 µM Y27632"
      },
      "notes": ""
    }
  ]
}